[{"product_id":"0528881469","text":"This remote was easy to program and easy to use. On the Time Warner Cable, it is a great value for the price. Be sure to write a reference with it!","product_category":"Electronics"},{"product_id":"0594296420","text":"This is a great product. The unit is very easy to use, and the price was right. It has a lot of features, but it does not have a lot of power to it. It's hard to get the unit to work and then it will not turn on. When it comes to the unit, you have to be able to use it for a few minutes and then you have to reset the unit to get it to work. If you are looking for a new one, then this is the one for you. It's a very good product and the price is right. The only thing that would be better is that it is a little more powerful than the original, but it's not a big deal. It's a great product for the price. You can't go wrong with this purchase.","product_category":"Electronics"},{"product_id":"0594451647","text":"Works great with the nook hd. Charged it up to a full charge and it works just fine. But for the price, it is a good solution for the money.","product_category":"Electronics"},{"product_id":"0966185056","text":"The cable is very nice and the price is great. It's not a big deal, but it works just fine. The only issue is that the cable is a little on the small side, so you can't stand it up and the back of the TV.","product_category":"Electronics"},{"product_id":"097185548X","text":"This is a great product. It's very easy to use, and the price is a must for you. It's easy to set up and use. The only downside is that it's a little hard to get the screen to come out of the case, but it's not a problem. If you are looking for a good-looking case, this is the one for you.","product_category":"Electronics"},{"product_id":"0972683275","text":"This is a great product. It's small and easy to use, and the price is very good. It's not a lot of money, but it's worth the price. It's also a great value for the price. It's very easy to use and it's easy to clean. The only downside is that it doesn't have a lot of bells and whistles, so it's not a big deal. It's a bit hard to get on and off, but it's nice to know that you're going to have a lot of fun with it.I am very happy with this purchase.","product_category":"Electronics"},{"product_id":"1400501776","text":"This is a great product. The installation was a little bit on the small side but the screws that came with it were so easy to put together. It was a little difficult to install, but it worked fine for the price and the quality of the product is nice. If you are looking for something to be mounted, this is it.","product_category":"Electronics"},{"product_id":"1400532620","text":"This is a great product, it's very easy to use and has a lot of features. It's easy to use, and the price is great for the price.I would recommend this product to anyone looking for an easy to use, and you can't beat the price.I've had it for about a month now and it works great.","product_category":"Electronics"},{"product_id":"1400532655","text":"This is a great product, and the price was right. It's very easy to use, and it has a lot of features that you can use. It's easy to use, and the fact that it doesn't take up a lot of room in the back of the case. The only thing is that it's not a big deal, but for the price, it's a great buy. It is very easy to use, and the battery life is just as good as the one that came with the Kindle.I would recommend this product to anyone who is looking for a great case.","product_category":"Electronics"},{"product_id":"140053271X","text":"This is a great device. The only problem is that it's not nearly as good as the original, but it does not. It is a bit sluggish and the device is not user friendly. If you are looking for a great product, this is the one for you. The app is very responsive and easy to use. The only thing is that it is a little bit of a hassle to get used to it, but it's not a big deal. It's a great product for the price. It is very user friendly and easy to use. You can't go wrong with this product. If you are looking for a solid, high quality product, this is the one for you.","product_category":"Electronics"},{"product_id":"1400599997","text":"Don't waste your money on this product. It's a great tool to use for the Nook HD. The screen is very easy to use, and you can't beat the price.I also like the fact that it comes with a stylus that doesn't interfere with your fingers. And it's very easy to use, and it's easy to carry in your hand when you don't have an iPad.I also like the fact that it's light and not bulky, so it doesn't stick to your hand.I would recommend this to anyone who is looking for a great keyboard.","product_category":"Electronics"},{"product_id":"1400699894","text":"This is a great product. It is compact and easy to use, and you can customize it with your Kindle Fire. In addition, it is very easy to use, and the price is right. It is a good value for the price. The only problem is that you can't use it to charge your Kindle, but it does not take up a lot of room in the back of the case. It's not a big deal, but if you are looking for a good case, you can't go wrong with this one. The only thing is that it is a little hard to read, but there is no place to put it on the side of the Kindle. It's a good thing to have when you want to use it for reading books, etc.","product_category":"Electronics"},{"product_id":"193493139X","text":"This is a great product. It's light weight and very easy to use. It is the perfect size for the Kindle Fire HD. The only problem is that it doesn't have an auto on\/off button. It's not a big deal, but for the price, it's a great product. You can't go wrong with this purchase. It is very light and has a nice feel to it.","product_category":"Electronics"},{"product_id":"3056508193","text":"The only difference that this one is that the screen is not what you have to use. The screen is pretty useless unless you press the button just to be pressed.","product_category":"Electronics"},{"product_id":"3283005737","text":"This is a great product. The price was right and the sound quality is good. It's not too big, but it's just a little bulky to get in the way of your phone.I would recommend this product to anyone.","product_category":"Electronics"},{"product_id":"3744295508","text":"DO NOT BUY THIS PRODUCT! This is a must have if you are looking for a good quality product for the money. It's very simple to use and works great. It has a lot of features that you can use for a few days, and it's very easy to use. The only downside is that it doesn't work as well as the 2nd generation, but it's not a big deal. It's not a big deal, but it's not worth the hassle of having to buy a new one. So far, it's a great product for the price. And the price is very reasonable and it's a great value for the money.I would recommend this to anyone who is looking for an easy to use camera for your camera or any other camera. The only thing is that you can't see the camera in the middle of the photo, but it's not a big deal. It's a great camera for the price, it's a great value for the price.I would recommend this camera to anyone looking for a great camera for the price.","product_category":"Electronics"},{"product_id":"7564005068","text":"This is a great product. The price was good and it works just as well as the original. No problems.","product_category":"Electronics"},{"product_id":"7793224531","text":"This is the perfect size and it's exactly what it was supposed to do. It was also very easy to set up, and the sound quality is awesome. A couple of people who have problems with it, but it's not a big deal, and the fact that you can see how it works when you are in the house. A friend of mine who bought it for his birthday and he loves it!","product_category":"Electronics"},{"product_id":"7799813393","text":"This is a great product. It was easy to install and works fine. The price was good and it is a great buy.","product_category":"Electronics"},{"product_id":"9756663855","text":"This is a great product. It was easy to install and has been working well for about 3 months. It's a good product to have. The only thing is that it doesn't have a USB port on the back of it.","product_category":"Electronics"},{"product_id":"9888002198","text":"You can't go wrong with this product. It's a great buy for the price. The only thing is that it doesn't take up a lot of room and you can't get it to work. It's a little difficult to put on and off, but it's not a big deal for the price. The only thing that would be better is if you don't have a lot of room in the back of your computer, it's a little hard to get on and off.I would recommend this to anyone who is looking for an easy to use camera.","product_category":"Electronics"},{"product_id":"9966559760","text":"This is a great product for the price. It was packaged very well and it worked just as well as the original. The only thing that could have been better is that it was a bit more expensive than the OEM charger. It's not a big deal, but it is worth the price. When it comes to using it, you can't beat the price for this product.I would recommend this product to anyone who wants to use it for a long time.","product_category":"Electronics"},{"product_id":"9981724742","text":"This product is great. It looks good and works as advertised. The only thing is that it doesn't have a USB port on the back of the device. You can't use it to charge your phone, but it's not a big deal.","product_category":"Electronics"},{"product_id":"9981739588","text":"The cable is a great price, but the picture quality is not good. It's a little hard to get the cable to work.","product_category":"Electronics"},{"product_id":"9981739677","text":"This is a great product and it's a good value for the price. It's very easy to use and it works well. The only thing is that the cable is a little small, but it's not too bad.","product_category":"Electronics"},{"product_id":"9983891204","text":"This is a great product. It works very well with the camera and it is easy to use. It's a great buy for the price.","product_category":"Electronics"},{"product_id":"9983891212","text":"Bought this to use as a cable to hook up the TV to the TV. Works great. It is easy to use and the picture quality is great. The screen is a little on the large side, but it's not too big. It is a nice size and looks good on the TV. The only downside is that the cable is a little flimsy.","product_category":"Electronics"},{"product_id":"9983891719","text":"This is a good product. It does not work, but it's a great deal for the price.I am very pleased with the quality of the product and it is a great buy.","product_category":"Electronics"},{"product_id":"998504780X","text":"This is a great product. It is very easy to use and it works. The price is excellent.","product_category":"Electronics"},{"product_id":"9985602560","text":"Purchased this to replace a cheap cable that came with the camera. It works great and the price is a little less than what you would pay for.","product_category":"Electronics"},{"product_id":"9985609034","text":"The product did not work well for the price. It was very easy to install and it works great.","product_category":"Electronics"},{"product_id":"9985665899","text":"The video works great but no audio. Had to add another one for the audio. The delivery was on time.","product_category":"Electronics"},{"product_id":"9989511314","text":"This is a great product. It is very easy to use and it works well for the price.","product_category":"Electronics"},{"product_id":"B000000X4N","text":"This is a great product for the price. It's not the same quality as the picture, but it does what it's supposed to do. The only thing is that you can't get it to work with your phone. It's not a good product, but it works just fine.","product_category":"Electronics"},{"product_id":"B000001OKG","text":"Don't waste your money on this product. It is a very nice quality, and it's so much better than the old one. It was easy to put together, and it's very easy to use. The only downside is that it doesn't seem to have a lot of friction on the back of the unit. It's not a big deal, but it's not a problem for you. If you're looking for something to use in the kitchen, this is the one for you. And the price was great.","product_category":"Electronics"},{"product_id":"B000001OKH","text":"The tapes were great at the end of the day, and the tapes were just as good as the Sony 120mm tapes. They are great for those who like to play music, or an old 120 min tapes, and they sound great.","product_category":"Electronics"},{"product_id":"B000001OKK","text":"The product arrived on time and in good condition. It is very easy to set up and use. The only downside is that it is a little small for what you are looking for. If you are looking for a great product, this is it.","product_category":"Electronics"}]