[{"product_id":"0511189877","product_category":"Electronics","review_body":"We had an old Time Warner Cable remote that was dropped into a bucket of dirty mop water.  We dried it out and it seemed to work &#34;fine&#34; except for the few times one of the batteries began to sizzle and smoke and became hotter than anything I had ever felt before and literally burned a hole in our couch upholstery.  Needless to say, this remote, the CLIKR-5, is awesome, easily programmed, and works perfectly with our TWC equipment and all the other A\/V components.  I love this remote... great product.  (Probably goes without saying, but just in case, you don't get the TWC logo on it.)"},{"product_id":"0511189877","product_category":"Electronics","review_body":"It is an exact duplicate of my Time warner remote.I bought it so my wife could control the TV from her chair and not ask me to do it every time.It works great.I would reccomend it to anyone."},{"product_id":"0511189877","product_category":"Electronics","review_body":"Works just like the rental unit supplied by the cable company.  In fact it is identical.  Just what I was looking for."},{"product_id":"0511189877","product_category":"Electronics","review_body":"Exactly like what I had and wanted. Works great so far"},{"product_id":"0511189877","product_category":"Electronics","review_body":"This remote was easy to program and operates all the features on Time Warner including On Demand. My TV is a Samsung and it took about 5 minutes. Be sure to write down your codes for future reference!"},{"product_id":"0511189877","product_category":"Electronics","review_body":"Just like the one from the cable company, but without the $3 monthly billing!"},{"product_id":"0511189877","product_category":"Electronics","review_body":"Came but you have to press on the buttons hard for it to work"},{"product_id":"0511189877","product_category":"Electronics","review_body":"As others said: works as well or better than original. If you've lost or broken yours, or if like mine some of the buttons just stopped responding, this is a great replacement - especially at this price."},{"product_id":"0528881469","product_category":"Electronics","review_body":"This is a great truck GPS. I've tried others and nothing seems to come close to the Rand McNally TND-700.    Excellent screen size and resolution. The audio is loud enough to be heard over road noise and the purr of my Kenworth\/Cat engine. I've used it for the last 8,000 miles or so and it has only glitched once. Just restarted it and it picked up on my route right where it should have. The exit lane screen has been spot on every time and gives me plenty of time to get my rig into the appropriate lane safely. I also love the multi-stop route planning and use it a lot. Updated regularly, it has shown me all the construction zones and has a feature to allow me to detour around them. Creating Groups and storing locations in them is a breeze so I can separate warehouse from store locations, etc.    I'm running an HP Pavilion laptop with Windows 7 OS for the dock and update. The USB port DOES charge the GPS, at least with my laptop, despite the warning in a previous review. Even if it didn't, the supplied 12-volt and AC chargers take care of getting the battery up to speed.    My complaints are relatively minor:    Battery life when it is unplugged isn't great. However, since I use it plugged in in the cab 95% of the time, it doesn't create too much of a problem.    The announcement of state borders coming up is nice but it doesn't tell you (or show you on the map display) what state you are in and\/or going into. Again, a minor issue because I know where I am but all my other GPS units had this feature. For $500 smackers, I don't expect this kind of slip-up.    There is a Micro SD slot on the unit and I bought a card for it. Unfortunately, the manual has absolutely no information on using it. The only reference is on the page showing the physical features of the unit, showing the position of the slot. Annoying.    Clean up the minor issues and this unit rates a solid 5.    [[ASIN:0528881469 Rand McNally 528881469 7-inch Intelliroute TND 700 Truck GPS]]"},{"product_id":"0528881469","product_category":"Electronics","review_body":"I did a lot of comparison shopping and decided to buy the Rand McNally 7\\\\\" GPS.  Has better graphics than Cobra 7\\\\\".  It does have lane assist which is important when in large metro areas and need to be in correct lane for exits, etc Atlanta, GA.  I have read some of the negative comments written earlier and I do not have those problems.  Sure, sometimes it does not give the fastest or the simplest route but it has never sent me down a non truck route like all the prior gps i have had in the past.  I am a car carrier so I set truck size at 13' 8\\\\\" and it has kept me from going down roads with 13'6\\\\\" bridges.  The only negative comment I have is that it constantly changes map views from city to county to state way to often.  Other than this, I love the fact that:                                                  1) it shows mileage to destination, arrival time (which you can change to time left),                                2) shows the city, county and state you are current located (how often we truck drivers pull over at a rest area or truck stop and wonder what city we are located).                                                                     3) large 7\\\\\" color screen for easy viewing and screen changes automatically for night time driving                                                                                   4) list truck poi and non truck poi (wish Rand McNally had a feature that would let us send them an update for poi, maybe when we get at a Loves that use to be a Pilot, just tap on the screen and edit info, then when I connect gps to computer for weekly update the map will get updated.                                                                5) able to update construction info by linking gps to computer and get updates given to Rand McNally by the states.  Unfortunately like usual  the states are mostly behind on updates given to Rand McNally.  This is where we the consumer should have the ability to tap screen and make corrections and send it to Rand McNally.  Many times I have gone into areas that it said \\\\\"Construction Ahead\\\\\" and no construction is being done because it has been completed.                                                                                                  6)  speed limits of highways and Interstates and shows your current speed just below it (also shows truck speed limits in red) Still the states have to report these limits to Rand McNally and as usual they are slow on reporting.  But still most of the time 95% it is correct.                                                        7)  great truckers tools like driving hours left.  It automatically changes to driving when truck has moved for more than 1 mile and changes to off duty if it is idle for 15 minutes.  It lets you know when you have 1 hour left to drive and that driving time has expired. You reset every day manually.  Also have total hours worked for day and hours left to work for the week. You will have to manually override this sometimes because it doesn't distinguish off duty and on duty hours well, you have to manually tell it you are on duty.  I just manually configure at the end of the day.  The important one is driving hours and end of the week hours.                                                                             8)  service reminders for your perimeters you set, such as 8000 and 16000 services.  You reset manually when completed.                                                                                                       9)  able to set many multiple stops set and ability to add more stops in route                                  10) loud enough to hear spoken text to speech street names over engine noise (and believe me my truck is loud)       11) ability to save your own poi (I do it all the time)                                                             12) it tells you when you are 3 miles from approaching a weight station (you can configure it up to 5 miles)        13) ittells you when you are 1 mile from state border and tells you when you cross border and what state you are in.                                                                                                                14) it tells you all mileage you driven that day and mileage by state and mileage by day.  saves info for 1 year.   Overall, this is definitely a truckers friend and I absolutely love this GPS.  A definite must buy."},{"product_id":"0528881469","product_category":"Electronics","review_body":"I have owned two Rand McNally GPS devices over the last two years. Buyer beware! They are pieces of junk. The software is great, but the hardware does not last. The first GPS lasted a year. I spent another $400, that one lasted about 14 months. If you don't mind spending $400 a year for a GPS buy one. Otherwise do not buy it it is the worst and most expensive piece of junk I have ever bought. I still use my original GARMIN I purchased in 2006."},{"product_id":"0528881469","product_category":"Electronics","review_body":"We had the GPS for quite a while with a minimal amount of problems.  The plug in port bent but Rand McNally replaced it.  We puchased the new TND720 and gave the TND700 to our driver.  Well, our ex driver - he was technologically challenged and let the until hang off the dash on a trip from KY to TX. When I told him to secure it to the dash, he threw it in the storage department above the dash, thus the ex employee,<br \/><br \/>I highly recommend the Rand McNally.  Rand McNally provides an excellent product and excellent support."},{"product_id":"0528881469","product_category":"Electronics","review_body":"Thought the unit was going to be a good unit, but was I wrong very wrong. The unit has a bad probleum with the 12 volty pulg in. They replaced the unit once in 6 months and the second unit last about 8 months before it started giving me trouble, but would they stand behind it NO NO NO. They said it had been over a year since I had bought the first unit so it was not covered.  The person I talked with at the Tec centered knew very well what I was talking about. If I made something that cost as much and made claims of how great a unit it was I would stand behind it and if I knew of probleums with the 12 plug in I would come up with a fix.  So take your chances if you buy one from Rand McNally hope it last for you but I have my doughts. Have a friend this last week his started have the same probleum so I told him he had better send it in."},{"product_id":"0528881469","product_category":"Electronics","review_body":"We got this GPS for my husband who is an (OTR) over the road trucker.  Very Impressed with the shipping time, it arrived a few days earlier than expected...  within a week of use however it started freezing up... could of just been a glitch in that unit.  Worked great when it worked!  Will work great for the normal person as well but does have the \\\\\"trucker\\\\\" option. (the big truck routes - tells you when a scale is coming up ect...)  Love the bigger screen, the ease of use, the ease of putting addresses into memory.  Nothing really bad to say about the unit with the exception of it freezing which is probably one in a million and that's just my luck.  I contacted the seller and within minutes of my email I received a email back with instructions for an exchange! VERY impressed all the way around!"},{"product_id":"0528881469","product_category":"Electronics","review_body":"I bought this product to use primarily for work. I log 3200+ mile a week and thought this would be a good to tool to have. I love the graphics. There were a few times that it routed me thru some residential areas and a couple of times I wondered if a truck was even legal at all. I loved the feature where I could see if there was a truck stop or rest area close by though it does not have them all. My main concern or problem with this device is in the charging port. The unit get to hot at this port. I went thru 3 12vlt chargers and 1 house wall charger. eventually the plug in had got to the point of being brittle and fell apart. I talk to Rand McNally about this they sent me 1 12 volt charger. But I had to pay for the rest and if I wanted them to look at it I would have to pay shipping out of my pocket. I have a problem with that because I paid so much for it to start. I had it about 2 mos. when it started having problems. I had it 10 mos. when it finally became useless and I thrrew it away. I replaced it with the rand Mcnally 510. It's a whole different animal with a whole lot more problems and will be taken back today."},{"product_id":"0528881469","product_category":"Electronics","review_body":"DONT WAIST YOUR MONEY ON THIS PRODUCT MY CELL PHONE GIVES ME BETTER DIRECTIONS AND FASTER ROUTES TO MY DESTINATION EVEN THOUGH ITS MAINLY A CAR ROUTE. RAND MCNALLY TND 700 HAS GOTTEN ME IN SEVERAL TIGHT SPOTS INCLUDING NON TRUCK ROUTES THAT I HAD TO BACK UP MY TRACTOR TRAILER IN THE MIDDLE OF DOWNTOWN CHARLOTTE.   THIS PRODUCT ALSO CANNOT READ MAPS CORRECTLY. IT HAS TOLD ME TO MAKE U TURNS AND GO SOUTH FOR 3 MILES TO CATCH A BY PASS ROUTE TO GET ON I 95  WHEN ALL I HAD TO DO WAS CONTINUE STRAIGHT FOR ABOUT 800 FEET AND MAKE A LEFT TO THE I95 ON RAMP.     THE LIST GOES ON AND ON. AND IHAVE TRIED TO CONTACT AMAZON SO THAT I CAN RETURN THIS PRODUCT AS IT REALLY SUCKS. NOW ITS FEATURES LIKE MILEAGE TRACKING BY STATE AND DAY TRAVELED ITS GREAT, BUT WHAT GOOD ARE ITS FEATURES WHEN YOU CANT GET TO YOUR DESTINATION ON TIME OR GET LOST BY THE SAME INSTRUMENT THAT IS SUPPOSED TO ELIMINATE JUST THAT."},{"product_id":"0594296420","product_category":"Electronics","review_body":"This is a must for the Barnes and Noble Simple Touch Ereader."},{"product_id":"0594296420","product_category":"Electronics","review_body":"I bought this item to replace the original charger that I'd lost. think is pricey and I was disappointed when I noticed the box only had the adapter, as the original box had both the plug and adapter. Don't buy just by the picture displayed, make sure to read the description. I am still missing the USB cable"},{"product_id":"0594296420","product_category":"Electronics","review_body":"now i can charge my nook anywhere, no need for pc. a touch pricey at about $10, but i'm happy."},{"product_id":"0594296420","product_category":"Electronics","review_body":"Love my Nook Charger... rapid charging"},{"product_id":"0594296420","product_category":"Electronics","review_body":"Works perfectly with the nook hd+. Charged it up from dead to full in just a couple hours. Sucks that you have to use the special charger and cable for the nook, but this is a good cheap solution for the one it is replacing."},{"product_id":"0594296420","product_category":"Electronics","review_body":"great"},{"product_id":"0594296420","product_category":"Electronics","review_body":"Good product."},{"product_id":"0594296420","product_category":"Electronics","review_body":"Works as expected."},{"product_id":"0594451647","product_category":"Electronics","review_body":"This product really works great but I found the following items you need to keep in mind:<br \/><br \/>- You must have your power adapter connected for it to work...it plugs in the the bottom. It appears it needs power from the nook power adapter to operate.<br \/>- The plug fits in loosely and you cannot move the Nook around much without holding the adapter in place.<br \/>- On initial plugin it seems you need to rock it around to get the connection but then it seems solid.<br \/>- It works with a 25ft high quality HDMI cable so you can put the NOOK across the room with you. Not tested with cheap cables.<br \/><br \/>Warning...I found that my LG SmartTV 3D from a few years back does not work with this adapter but it does not seem to work with many things...bad software. This adapter works fine with other HDMI devices I have used like monitors and I am sure other TVs.<br \/><br \/>Gave it five stars because it really is nice to extend the screen and use your Nook as a streaming server to your TV. Nice they made such a device."},{"product_id":"0594451647","product_category":"Electronics","review_body":"amazon was about the only place i found one at a reasonable price."},{"product_id":"0594451647","product_category":"Electronics","review_body":"Works perfectly for tv viewing."},{"product_id":"0594451647","product_category":"Electronics","review_body":"I bought the Barnes & Noble Nook HDTV Adapter Kit and I am not able to view video or movies through it.  The cable is working and I can display what's on my nook onto a TV screen, but as soon as you start playing the movie the TV side goes black and you can then only see the image on the nook.  You pause the movie and it pops back up on the TV screen."},{"product_id":"0594451647","product_category":"Electronics","review_body":"Great to be able to hook your nook up to TV and watch netflix, hbo-go, etc on it.  Cord could be a bit longer, but works okay - just have to have nook close to the tv."},{"product_id":"0594451647","product_category":"Electronics","review_body":"It's cool for my tablet to hook up to my tv, I just hate that it is not fully widescreen on my tv. I also do not like the short cord which means the tablet basically has to be over there on the tv stand with the tv, and also the plug comes out of the tablet very easily if moved.... But these are the breaks I guess. I have had no issues with playback, its good just poorly designed."},{"product_id":"0594451647","product_category":"Electronics","review_body":"happy i can stream from my Nook. works great."},{"product_id":"0594451647","product_category":"Electronics","review_body":"The cable is very wobbly and sometimes disconnects itself.<br \/><br \/>The price is completely unfair and only works with the Nook HD and HD+"},{"product_id":"0966185056","product_category":"Electronics","review_body":"This DVD is a little strange at times. It's cute enough considering I bought it USED for around $2. But if you're going to have to pay  much more than that...don't. Some parts are cute, some are just wierd looking."},{"product_id":"0966185056","product_category":"Electronics","review_body":"Oh boy. still images of Christmas cards, mall santas, Christmas trees, toys, and decorations with musical background. The people who gave this DVD a good review either live in a cardboard world, or they work for the company who produced this hunk-o-junk!"},{"product_id":"0966185056","product_category":"Electronics","review_body":"A rich repertoire of beautiful Christmas music with various and numerous scenes of holiday symbols and events. I play this one all year long - very peaceful. A true classic."},{"product_id":"0966185056","product_category":"Electronics","review_body":"I love Christmas videos and music, but I usually read and\/or inquire about the material -- whatever it is -- before I purchase it; inevitably, sales for this particular dvd would increase if more particulars were given  regarding its contents. Shame."},{"product_id":"0966185056","product_category":"Electronics","review_body":"This is a must see for the X-mas season.  It is a tradition in our family to play this movie while we are setting up our tree and decorating our home for the holidays.  When you can't always see the TV screen to see the beautiful X-mas scenery we can still hear the wonderful holiday music playing.  It along with our other holiday movies are played often throughout the month of December."},{"product_id":"0966185056","product_category":"Electronics","review_body":"I can only imagine that those who gave this video 4 or 5 stars must be somehow receiving a share of the profits. I feel completely robbed--you know, that kicked in the gut feeling you get when you realize you've been suckered! There is almost nothing here visually but still images, none of them particularly interesting or poignant. In fact most are simply tacky. Wreaths on somebody's front door, a local mall's Christmas decorations. A house with a light display no more impressive than my neighbor's. Photographs, I kid you not, of Christmas cards. Not one or two, but sequences of dozens--none of them very appealing or interesting. This \\\\\"video\\\\\" seems to have been made by someone who just drove around town for a few days and took pictures of anything and everything even vaguely related to Christmas. It may be good for shut-ins who can't make it to the mall to see what The Gap or Limited II has put in it's windows. It's like an annoying colleague who insists you look at his Christmas pictures and gushes over them as you think to yourself, so what?"},{"product_id":"0966185056","product_category":"Electronics","review_body":"This is a very thorough, relaxing Christmas-season video.  It's a true &quot;classic&quot; that has been around for 15 years.  I mostly agree with &quot;pianistcritic's&quot; earlier review here, except that I found Steve Amerson's rendition of &quot;Is There a Place?&quot; to be quite excellent and very appropriate for the CHRISTmas season.  He was one of the song's composers.  If lip-sync was used, it was done tastefully.  This is a MUST HAVE video which I find is excellent for gift-giving.  You'll play it every year!  It really gives you the Christmas spirit!"},{"product_id":"0966185056","product_category":"Electronics","review_body":"<br \/>I am a huge Christmas fan.   <br \/>This DVD is played from the begining of December to the 25 at our house.  This not a movie!! DUH. It is images and music of Christmas, and I think it's the best for getting in the mood for the season. <br \/>But don't think it's any kind of Christmas movie.  It is exactly what the title says!   <br \/>"},{"product_id":"097185548X","product_category":"Electronics","review_body":"Dave Ramsey and his team are amazing. This is a wonderful read and present. It changed so many lives around me including my own."},{"product_id":"097185548X","product_category":"Electronics","review_body":"This is a second copy we have purchased because so many people ask about it!  It IS life changing no matter how long it takes!"},{"product_id":"097185548X","product_category":"Electronics","review_body":"I have enjoyed listening to the Financial Peace 13 lessons CD by Dave Ramsey. A lot of the information he covers in the lessons I have heard over the years on his radio program. This has been a great way to refresh my memory on several of the things I already know and practice. I have also gained some new information I didn't know about retirement investing and insurance. I am very pleased with my purchase."},{"product_id":"097185548X","product_category":"Electronics","review_body":"Never heard anything like it!  It is truly changing my life!  Everyone should have a copy of Dave Ramsey in their home!"},{"product_id":"097185548X","product_category":"Electronics","review_body":"Sensible financial concepts that everyone should know about."},{"product_id":"097185548X","product_category":"Electronics","review_body":"Always have liked Dave Ramsey.  My wife and I have been very successful financially because we found this at an early age.  I just now have purchased the full series to go over it all again."},{"product_id":"097185548X","product_category":"Electronics","review_body":"AWESOME SELLER, DEAL & CONTENT! I've listen to Dave Ramsey and he is THE BEST! I bought Dave Ramsey's Financial Peace University for myself and I bought a second one for a family member (they weren't getting mine...I just couldn't part with it). Dave Ramsey's CD's and program are easy listening and totally do-able!<br \/><br \/>My family member was a die-hard instant gratification\/impulse spender and now I'm happy to say has listened to Dave Ramsey and has implemented Dave's strategies. I'm not talking about a kid here, this person is in his mid-fifties and has had this unconscious spending mindset all of his life. From the very first Dave Ramsey CD that he popped into his car CD player, he was hooked! He even looked forward to repetitive listening of each CD several times to have it become ingrained in his memory before moving on to the next one...very cool!<br \/><br \/>His transformation is amazing! He's turned his life around to be a financial wizard and has learned how to accelerate getting out of debt years sooner than he otherwise would have done.<br \/><br \/>He's so much more financially responsible with his retirement planning\/investment funds\/insurance policies and especially of conscious spending of his money. He's become a very smart shopper that recognizes the difference between \\\\\"wants\\\\\" and \\\\\"needs\\\\\" and if it's not a \\\\\"need\\\\\" he doesn't \\\\\"want\\\\\" it.<br \/><br \/>Best of all, he's not stressed out over doing it. He's actually happy and looks forward to finding different ways of saving money. It's so fun to carry on a financial conversation because there is no more tension and frustration that goes with it. Instead, he lights up and even initiates conversations regarding finances. I never thought I would ever see the day when that would happen, so thank you very much Dave Ramsey! A million times thank you!<br \/><br \/>You won't regret buying any of Dave Ramsey's programs...you'll only regret it if you don't!  :D"},{"product_id":"097185548X","product_category":"Electronics","review_body":"You just can't go wrong if you get these CDs. They are very entertaining and extremely knowledgeable. Just put them on in the car on your way to and from work and in two weeks, you're done with all the cds and learned a ton about financial planning and preparing for retirement, getting out debt, saving for your kids school, and hundreds of other topics. Great CDs!"},{"product_id":"0972683275","product_category":"Electronics","review_body":"This took a lil longer to put up them we expected but it holds our 55 inch smart tv perfectly! We love it!"},{"product_id":"0972683275","product_category":"Electronics","review_body":"I have mounted a 42 inch old LCD. Easy to install. Easy to swivel, there is tilt option but it has to be locked by nuts(it can not be changed without loosing the nuts)."},{"product_id":"0972683275","product_category":"Electronics","review_body":"holds a 32 inch vizeo well and the adjustment is great"},{"product_id":"0972683275","product_category":"Electronics","review_body":"Good product. Used on a 24&#34; TV. Had a little issue with the length of the screws that came with, but I had other washers to use so it worked out ok. Seems nice and sturdy once I got it mounted on the wall."},{"product_id":"0972683275","product_category":"Electronics","review_body":"I would have given this a 5 star rating, but it came without instructions and there were parts missing. The part is that once I figured it out, I didn't need the missing parts, and it works like a charm."},{"product_id":"0972683275","product_category":"Electronics","review_body":"This is a well made product for the price. The installation was simple but mounting the actual TV wasn't. You have to lift and hold the TV up so as to align the holes for the screws. An extra person was needed. Once up, the Tv leans to the left. The mount was installed level and the first arm is level but second arm is not. However, it fits my needs and for the price I am satisfied."},{"product_id":"0972683275","product_category":"Electronics","review_body":"Does what it's intended for below pricing found on other brands. I have a 32\\\\\" mo nted in the bedroom with this. Seems sturdy emough for it...went up easily. Only reason for docking one star is the difficulty in adjusting the unit in the beginning. You really need (on my unit at least) to work it for a while before installing so you don't have to put so much stress on the mounts once installed. It was VERY stiff and took quite a bit of muscle to loosen it up enough to adjust...even with the adjusters loosened for this purpose...suppose it's better to have it too tight than loose and have the tv \\\\\"drift\\\\\" around.  For $25.00 that I paid for a decent mount that has the range of angles...great find."},{"product_id":"0972683275","product_category":"Electronics","review_body":"easy to install and it still has a 32&#34; TV hanging off of it. Like the way it swings from side to side."},{"product_id":"1400501776","product_category":"Electronics","review_body":"Got this one for my mom for christmas..thought it would be like the 5other tablets i have but its not..u can not download anything for FREE that is worth having on there play we went to everything you could image and still dont let you..CANT EVEN DOWNLOAD CANDY CRUSH she spent about $10 ON things that siad candy crush and they were guides not the game ..let someone else look at it they told her she would have to get on FACEBOOK and set up account and get candy crush like that what good that does when u have to have internet to play it and not alway goin to have WII FI around"},{"product_id":"1400501776","product_category":"Electronics","review_body":"I bought my wife a Nook for Christmas two years ago, and she has used the heck out<br \/>of it, so I have always wanted one for myself. When I saw the price break on this one<br \/>I had to act! It meets all my expectations."},{"product_id":"1400501776","product_category":"Electronics","review_body":"So far so good.....we haven't, (but I have) spent much time on it.  I got for my daughter for Christmas....I'll keep you posted after the Holiday Season.  thank you."},{"product_id":"1400501776","product_category":"Electronics","review_body":"I don't like the product that much, but the company delivered it very quickly. The Nook pales in comparison to both the Kindle and the Ipad and I regret purchasing it."},{"product_id":"1400501776","product_category":"Electronics","review_body":"This was purchased as a Christmas gift for my niece.  What can I say………she loves it and uses it a lot !!"},{"product_id":"1400501776","product_category":"Electronics","review_body":"The Nook tablet has limitations as to where you can go with it. Certain apps cannot be downloaded. Its very good for reading."},{"product_id":"1400501776","product_category":"Electronics","review_body":"I purchased this for my 96 year old mother, who loves to read, but her eyesight is not good. She would hold the book in her lap and use a handheld magnifying glass to read. Now she can hold or lean the Nook on a pillow and read to her heart's content!! The ability to adjust the sizing of the words is what sold me, and it's also good for me to email and check Facebook!!"},{"product_id":"1400501776","product_category":"Electronics","review_body":"I put off buying a reader for several years because it seemed like a luxury my tight budget didn't need. Also, I'd had one of the early Sony readers, used it a lot for a couple of months, then never really used it anymore.  But when I received a gift card this spring, I thought, \\\\\"This is going to be spent on something I wouldn't blow my own money on but I want.\\\\\"  I knew I didn't want a Kindle because of both the issues of \\\\\"locked in\\\\\" book buying and no way to use extra storage (SD card), so I started reading about the Nooks and settled on the Tablet.<br \/><br \/>I am in love!  This little tablet that I hoped I might use maybe once or even twice a week gets used every day, often for hours at a stretch!  I didn't buy it for an iPad substitute, but I really do use the browser a lot more than I expected to check email, read some of my discussion forums, etc.  And the convenience of the device, and esp. of using the Overdrive service to borrow ebooks for free and without having to leave the house, has me back to my favorite hobby that I've been away from for years--READING!<br \/><br \/>Highly, HIGHLY recommend!"},{"product_id":"1400532620","product_category":"Electronics","review_body":"Do not buy a Nook!!!! Spend you money else where. We have both a color and a black and white. Both are less than a year old and have had to be replaced already. Now the B&W needs to be replaced again. Tech support is a joke!!! In store support is just a little better-if there is a store close to you. Would never buy one again-company will not refund. BAD NEWS!!!!"},{"product_id":"1400532620","product_category":"Electronics","review_body":"WATCH OUT WHEN YOU TAKE IT OFF THE CHARGER!!!   I PULLED OUT THE CHARGER FROM MY NOOK(BLACK&WHITE) AND IT TOTALLY RIPPED OUT THE CONNECTOR INSIDE THE NOOK!    IT WAS A MEGA FAIL TO ME BECAUSE THEY TOLD ME IT WASNT APART OF THE WARRENTY!!"},{"product_id":"1400532620","product_category":"Electronics","review_body":"I would LOVE to have known that you absolutely, positively MUST HAVE wi-fi access to even register this product (which I don't have at home). It came with a USB cable but apparently that was just for looks...<br \/>I would have had to drive somewhere that was an AT&T hot spot to even use it for the first time (who knows if it would work in a Verizon hot spot)! And since there is no Barnes & Noble store in my town I would have had to drive a minimum of 30 miles to use their in-store \\\\\"lending\\\\\" feature.<br \/>There is such a minimum of information on the outside of the box, in the store where I purchased it or even online that it wasn't until I got it home and unwrapped it that I found this out.<br \/>I was bummed.<br \/>I think I will be buying a Kobo or Kindle instead. At least those give you the option of hooking it up to a computer connection the usual way (with the provided USB cable)."},{"product_id":"1400532620","product_category":"Electronics","review_body":"Well the nook serves its purpose well. It is great in high levels of bright sun light and even does well in the shade. Battery life is amazing and the nook library is defiantly growing. Love the whole idea of narrowing books from friends and your local library."},{"product_id":"1400532620","product_category":"Electronics","review_body":"Item is well made for the product it was intended for. Help the nook right in place tight and well secured. A++++++++++++ for this item."},{"product_id":"1400532620","product_category":"Electronics","review_body":"Last month, my Nook became completely pixilated and unreadable... got a replacement, same thing happened within 3 weeks. B&N is replacing it, but will not let me pay the difference to get a Nook color. I do NOT recommend the standard Nook, as I've had two defective devices in less than a month.     I appreciate their willingness to replace the device, but am very frustrated by the defects, and the fact that they will not allow me to exchange it (and pay the difference!) for a Nook Color, when clearly the standard Nook is a subpar product."},{"product_id":"1400532620","product_category":"Electronics","review_body":"This was my first e-reader, and remains my favorite.  I am a huge fan of e-ink, and enjoy the look of reading from paper.  It is very simple to use, and books can be easily side-loaded with the free Calibre software.  Page turn time is quick, but quicker with the newer version.  Battery life does last about two weeks, reading a pace of at least one to two hours per day.  Battery is only consumed when the color screen is on or when pages are turned.<br \/><br \/>Of course, as a Prime customer, I really need a Kindle :)"},{"product_id":"1400532620","product_category":"Electronics","review_body":"I selected the black and white NOOK over the Kindle because I can download books from public libraries to my laptop and copy them to the NOOK.  We travel full time in our RV, and I have library cards in three states.  I can always find books I want to read from the libraries.  I haven't bought a book since I bought the NOOK four months ago.    The display is incredible.  I sit in the sun and read a lot, and the brighter the sunlight, the better the display.  Try that with a traditional LCD display.  Since the black and white NOOK has no backlight for the book pages, it requires as much ambient light as a traditional paper book.  In dim lighting I use a clip-on book light, as I did with paper books.    While I can use the NOOK several hours a day for several days between charges, an hour or two a day of charging keeps it charged.  The NOOK Color has a much shorter battery life, as well as being heavier.    The 3G option for the NOOK is a waste of money unless you want to buy books and magazines directly from Barnes & Noble, or if you want to try to use the NOOK as a tablet computer.  It really doesn't have the horsepower for that."},{"product_id":"1400532655","product_category":"Electronics","review_body":"The reviews so far are really good, so I dont need to add more on the actual features. Now did you know that buying directly from B & N, the Nookcolor is actually $249? Also, for those who are concerned about the lcd, dont worry. You can adjust the brightness level. I lower it when I read at night in the dark, and when its daylight and I want more clarity, I can brighten it. You can use literature published in so many digital formats (but not amazon kindle format, which doesnt play well with others), and its just a pleasure to use. Someone mentioned that when you have it plugged for charging and try to type on the keyboard, it doubles the characters. Yeah, been there, done that, true story, so hopefully as they update the software, that will improve, but once you unplug, everything seems to work very nicely. If you want a nice reading environment, I really would recommend the nook color. It makes reading such a pleasure, at a very decent price for the product you are buying. I actually like that it has a tiny bit of \\\\\"weight\\\\\" to it. Now my little droid incredible, which had been my reader til I got the NookColor, feels so...light! Almost TOO light! And...it LOOKS so elegant. I actually prefer having the plastic\/metal (not sure what it is actually, but it feels nice and looks nicer) bezel as opposed to the ipad glass to the edge type construction. It gives me a nice place to put my fingers. And get a nice cover for it. B & N has some very nice ones. Yes, some are a bit pricey, but I really think its worth the investment. Mine already has fallen to the carpeted ground when my dog figured I had been reading long enough, and wanted some attention. I was very glad I had it in a cover. However, with the bezel and the rubberized back, I dont think I would have had a heart attack if it fell uncovered. I would never risk that, but it looks and feels as though it could take a bit of a tumble without much trouble, at least onto carpet. It just seems less fragile than the ipad or galaxy tab.  The book collections are extensive, and I also had quite a collection of pdf books which I very easily downloaded. And I LOVE the free trial for the magazines. To discontinue any of them you decide you dont want, you have to log into your online nook account on the B $ N website, and find the \\\\\"manage subscriptions\\\\\" link. Took me a minute to figure that out, so hopefully that tidbit will save you some frustration. But overall, its a wonderful, colorful, very nice user experience. Its an ereader first and foremost, and it does that very well. It just happens to have a few lil extra goodies tossed in to boot! Dont compare it to the ipad. It isnt supposed to BE the ipad! Let it have its own little niche, and I promise you will be as happy with it as I am!"},{"product_id":"1400532655","product_category":"Electronics","review_body":"Amazon lists the NOOKcolor for over $300 but it's available at barnesandnoble.com for $249 + tax (~$269.) Also, the \\\\\"Item Weight\\\\\" listed is two pounds but it is less than one pound (15.8 oz.)  This is heavier than the Kindle but lighter than the iPad.  Weight is an important factor when holding an e-reader for long periods.  It appears Amazon is unfairly representing its competition.    This little device is no joke.  Amongst other specifications mentioned by others it has the following:    * CPU Processor: 800 MHz ARM Cortex A8-based Ti OMAP 3621; same processor as Droid 2 and Droid X.  * Graphics Processor: PowerVR SGX530; same GPU as Droid 2 and Droid X.  * RAM: 512MB    For a diagram of the OMAP 3621 search for \\\\\"engadget Nook Color processor revealedOMAP 3621.\\\\\"    For the full specifications search: \\\\\"androidtablets 3483-nookcolor-full-specifications\\\\\"    For a more flexible open alternative including Android 2.2, 1 GHz ARM, 256 MB RAM, HD Video 720p, HDMI, et cetera look at Archos 70 8GB for $275 or the Archos 101 16GB, $350.  These are good alternatives at least until Android 2.3 and 3.0 arrive."},{"product_id":"1400532655","product_category":"Electronics","review_body":"Unless you are a VERY careful user, this charger will not last you very long.  Mine lasted about 4 months. It is NOT a standard USB charger, so you cannot buy an off-the-shelf charger (The Nooks USB insert is longer and let's the charger do a \\\\\"fast charge\\\\\", if you use a standard charger, it will take overnight).  Barnes and Noble told me to go to bn.com and buy a new one. Poor service from support, if you ask me."},{"product_id":"1400532655","product_category":"Electronics","review_body":"I really love this device.  The only problem is, I would not enjoy it nearly as much without the ability to root it and load up a custom ROM.  The stock nook os is sluggish and extremely limited.  The stock app market is a joke.  So if you are willing to dig around to find out how to root this, i would highly recommend getting it.  If not, I would pay a little more for a different android tablet.     Good:  Screen is great and responsive.  The battery life is what I expected...8 or so hours.  The device feels solid.  I really like the design and build quality of this device.  Cheap, look around you can get it for $200 refurbished.    Bad:  Its native operating system is very limited and feels sluggish."},{"product_id":"1400532655","product_category":"Electronics","review_body":"I bought a refurbished Nook Color a few months ago as well as a dual-boot android Micro-SD card (from eBay).  This is by far the best value tablet I've found anywhere!  NC is well made, arrived in like-new condition, reliable, responsive and by booting to full Android (with the dual-boot micro-SD) it is a real tablet with full access to the Android market. Only cons are lack of microphone or camera, but for a total cost of <$180 it's awesome!  Good battery life, beautiful screen, responsive and a really excellent reader (especially in low light - but the screen can be made very bright for daytime use).  I also have a Kindle keyboard which I love for daytime reading but the NC works in the evenings in a darkened room and does all the other things a tablet can do.  Just NC on a holiday trip and left my laptop behind!  NC was perfect for email, RSS, games and reading, including pdf books and Netflix movies.  If you have an Android phone, using this is the same with a much better screen.  It's a really good tablet as is, but with the dual-boot MSD card it is an awesome deal!"},{"product_id":"1400532655","product_category":"Electronics","review_body":"I am the occasional reader but, I bought this for tablet capability.  It can be rooted in about 2 minutes to have app store.  Once that is done, You can use a home screen alternative and program to switch it to hide the overbearing and hindering B&N store.  It's still there but, not right in my face. Default browser is OK  but, I prefer Dolphin HD.  It's much more than half and Ipad at exactly half the price.  Plus, when used as a reader, it's just light and small enough to be effective at that purpose.  I had a Pandigital novel that I got for Xmas that completely died in 3 weeks.  I took the refund money and made the smartest purchase that I can remember making:  The Nook Color.  The novel is pure garbage compared to this device.  Android 2.1 is so much better than 1.6.  I also couldn't get many apps to run on the novel  where this runs almost everything. Spend the extra $ and get the color.  Save the extra money from the Ipad. I was considering Archos 70 but, I couldn't find anywhere to actually play with it.  Plus, given their history; I had decided against it.  Good:  Nice screen,  capacitive touch,  strong wifi, decent battery life, Nice CPU @ 800 MHz,  512 MB RAM  Ipad only has 256  supposedly), Tons of free apps available, very reasonably priced,  portable,  Barnes and Noble magazines  very reasonably priced at $1 to $3 an issue), microsd slot.  Bad  minor complaints):  that silly plastic thing in the corner, mono speaker, micorsd slot instead of sdhc card slot, doesn't come with android market.  Overall this is the best tablet for the money currently and probably will be for quite a while.  UPDATE.  Couple of small annoyances: randomly reboots instead of sleeping, wireless doesn't come back up sometimes after rebooting.  Still very happy with it though. Sleep issue apparently also happens to those who haven't rooted.  I'm sure it will be fixed with update.  UPDATE:  I am very unhappy with Barnes and Noble's many attempts to update my firmware without my permission.  They have tried twice and didn't succeed.  I believe that AVG antivirus is stopping it.  They got my girlfriend's and we have the same nook, that came with same firmware, that was flashed with same mod.  The only thing I can think of was AVG must have stopped it.  They got hers weeks ago and mine is still fine.  She wasn't running AVG and mine was.  It's the only thing I can think of.    Who else does that?  I have items from Sony, Microsoft, Nintendo, HTC (Sprint), etc and NONE of them update my property.  Who do these people think they are? Well, they won't be updating my firmware and now I won't be buying books from them either.  Anyway, it's an aging piece of hardware and now for a bit more money something better can be bought.  Side Note:  I had ordered a touchpad from B&N back on AUgust 21st.  Not only did I not get one, they cancelled my order for me without so much as an email.  Not very nice."},{"product_id":"1400532655","product_category":"Electronics","review_body":"i got it broken but fixed it a week later an also had to replace the charger it wasnt puting any charge out .other then that it was sent on time scratch free very well clean besides the power not working"},{"product_id":"1400532655","product_category":"Electronics","review_body":"Best buy associate did not help me with Kindle, i snapped, bought a nook. Loving it. Dont know why i was going for the kindle in the first place. I highly recommend this to anyone who wants to get something between a kindle and an ipad."},{"product_id":"140053271X","product_category":"Electronics","review_body":"The advantage of the nook over a kindle is simplicity when you aren't buying a book (ie, when you're obtaining a digital backup of a physical book you own, library digital checkouts, or you're pirating one.)  All the books I buy are from Amazon, and so with the nook it won't sync those which is unfortunate.  But where it shines is when I refuse to buy a book because the publishers are being greedy (eg, Dance with Dragons by George RR Martin, game of thrones series...  The ebook costs more than a physical copy.  It even costs more than a physical copy translated into another language!  Give me a break!)  So anyway, when it comes down to piracy to keep the publishers in check - the nook is great.  You plug it into USB, it shows up as a drive on the computer.  You type in the name of a book into google and add \\\\\"epub download\\\\\" to the end, and somewhere on the first page of results is a working download (at least with every book I've had to try so far.)  Download that straight to the nook's drive letter and you're done.<br \/><br \/>The main reason I wanted it originally, before I found out how incredibly easy the above was, was because of the shape and feel.  I love the shape and feel over the kindle.  But other than that and the simplicity I'd probably go with a kindle for legit purchases (also I'm pretty sure the nook has been officially abandoned by B&N, which will of course make any syncing that may have existed even more problematic in the future.)"},{"product_id":"140053271X","product_category":"Electronics","review_body":"I've used the Nook Touch and the Kindle Touch\/Kindle Paperwhite extensively and the Nook is the best. Why? I'm convinced that if anyone prefers the Kindle its because they've never tried the Nook. Or they have friends that used Kindle and don't want to venture out on their own.<br \/><br \/>First the Nook feels better. It has a soft plastic outside with a curved back that makes holding the device quite pleasant. It has just enough area around the screen that you can hold easily without mistakenly turning pages. And the side page turn buttons are deep enough you won't turn pages by accident. Some might not like it because you have to push pretty hard, but that's by design.<br \/><br \/>Second the platform is user friendly and great to navigate.<br \/><br \/>Third the font choices are better and you get several more to choose from. Plus the size options all make sense. For instance on the Kindle the couple smallest font sizes are so small I can't see why anyone would use them and to me it's a waste.<br \/><br \/>Fourth the buttons are all well placed.<br \/><br \/>Fifth there are no ads and you can even upload your own pictures.<br \/><br \/>Go try one today. I'm fairly confident you'll love it.....unless you don't."},{"product_id":"140053271X","product_category":"Electronics","review_body":"very comfortable.<br \/>very reliable. a pleasure to hold in your hands. eyes do not get tired.<br \/>a small price for such a device"},{"product_id":"140053271X","product_category":"Electronics","review_body":"2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/>2<br \/><br \/>2<br \/>2<br \/>2<br \/>2fore<br \/>2<br \/>2<br \/>2<br \/>2<br \/>wors<br \/>s<br \/>s<br \/>s<br \/>s<br \/>s<br \/>s<br \/>wrods<br \/>sopp;<br \/><br \/>doe"},{"product_id":"140053271X","product_category":"Electronics","review_body":"Bought second-hand. At first the bad start, after a factory reset and flashing is working properly."},{"product_id":"140053271X","product_category":"Electronics","review_body":"I love the B&N Nook Simple Touch.  I can't compare it to the Amazon Paperwhite, because I refuse to try one.  The Nook has expandable memory (which I do not believe the Paperwhite does).  Up to 32GB, which means I can save around 32,000 books.  If, for some reason, I need more space, then I can just drop another 15-20 bucks, and have another 32GB (though I will have my collection split over two memory cards).  I also like that B&N accepts ePub, which is pretty much the universal standard, whereas Amazon locks you into their own store.  This means that you can shop Sony's store with a Nook, and Nook's store with a Sony, but Amazon can't access either of those stores.<br \/><br \/>The downside to this is that, as of now, Amazon books tend to be cheaper than any other e-reader store.  However, all the ebooks are usually within a dollar or two, and I like having the freedom to go and purchase e books from multiple stores, instead of just being locked into one.<br \/><br \/>This is NOT a tablet, and as such, you can't surf the web, download apps, or play games.  What you CAN do is eliminate the tens, if not hundreds, of pounds of books that sit on your bookshelf."},{"product_id":"140053271X","product_category":"Electronics","review_body":"Bought this as my original Nook died and I have an iPad, but can't read on it outside and that's what I needed for at the cabin and on vacation."},{"product_id":"140053271X","product_category":"Electronics","review_body":"I squashed my first nook in a rucksack and the screen though not cracked was ruined for making coherent text. They ought to be waterproof and strong enough to drive a truck over maybe. I liked the ability to carry a portable library around on a bike to better pursue scholarship outside academia and the political correctness of the ultra-establishment people against liberty, property and internet publishing liberty for differing opinion."},{"product_id":"1400599997","product_category":"Electronics","review_body":"I spent months going back and forth on the e-reader idea and researched the Nook, Kindle, and some others like the Kobo.  I was really set on the Kindle but after reading some more about the Barnes & Noble Nook it really clicked with me.  I liked the idea of a user-accessible battery, and the formats that are compatible with this e-reader.  The B&N ebook library had a much larger selection at the time and of books i was really wanting that I couldn't find on amazon.  At first the touch screen seemed ridiculous and somewhat pointless, this caused me to really lean towards the Kindles as I figured it would really drain the battery and was more of a gimmick than a necessary part of the device. BUT after using the Nook it just makes navigation quick and awesome, totally won me over and I hope on the next gen they don't decide to do away with the touch screen.  You can set it to shut off when not in use for a few seconds and the battery lasts quite a long time.  When the touch screen is off it still works to turn pages.  You just swipe your finger across the dark screen, pages turn, it's quite nice.    E-readers in general didn't click with me, didn't think I'd really use it as anything more than a \\\\\"toy of the week,\\\\\" but after the first 2 weeks my Nook has become probably my favorite device that I've gotten, over my ipod even, i just love it (and it's so sleek too).  Navigating the bookstore is incredibly simple and I LOVE being able to read reviews online with it for books and making wishlists.  Finding selections of free ebooks is a snap.  The e-ink screen is amazing, if you haven't tried reading on one do it.  It is definitely superior to trying to read on an lcd screen.  Being able to change text size is also a huge plus (pretty standard on all ereaders, just stating my love for the option).  I haven't had a single software\/hardware problem at all so that is great.  The only thing i hope they update on the software is making it possible to organize books into customized categories\/folders (unless you can and I just don't know how).      Supposedly you can link up to 5 Nooks to one account so they can all share the same library of ebooks you've purchased so now I'm trying to get my family members to buy Nooks as well!  I am shocked at how pleased I am with my Nook, it's just been a pleasure to use.    -Nik"},{"product_id":"1400599997","product_category":"Electronics","review_body":"My library has grown because the cost of books is less in many cases. B&N offers free Friday's where they offer a well known book and you download it for free if you like. I can download books from my local library which Kindle you cannot do. The web surfing is a bit slow but I didn't buy it to surf the net, but if need be I can check email or a product. I enjoy the on board dictionary, I read a bit on the tech side and occasionally run into a word that I want to know more about. Well I am just happy!    G"},{"product_id":"1400599997","product_category":"Electronics","review_body":"I love this device. It's a very handy item to take on the go. It's easy to use and downloading titles is a snap. Definitely recommend."},{"product_id":"1400599997","product_category":"Electronics","review_body":"I love my Nook. it is charming and I can customize it with different colors,  and use my own pictures as screensavers.   In addition, I can \\\\\"see\\\\\" the real covers of books and magazines in color at the bottom of the devise.  My friend has a Kindle and she is always complaining,  besides the text- to- speech is not available with all books.    Good thing is that Nook supports epub while Kindle does not.  The Nook has a user replaceable battery, if I need. On top of all reasons, I can read  any book for free if I go to the store, to me it is handy, because I like to go to B&N and spend sometime there reading, drinking a good coffee etc.  However, I believe that the choice of e-readers ( and there are so many out there!) will depend on what features you like as they are all good products.  I have an Iliad as well, but with Nook I can buy books no matter where I am."},{"product_id":"1400599997","product_category":"Electronics","review_body":"I got it with no problems, any i came even with books for free :) sdfsdfds sdfdsfds sdfsd sfs sdfsd"},{"product_id":"1400599997","product_category":"Electronics","review_body":"In my opinion the Nook rates a 5 for reading pleasure!  Clear print, easy turn of pages, no glare in reading outside. Love it for reading.  But my love of it stops there. My disappointments are that I'm now carrying this new toy in my purse, but can't use it for anything other than reading.  Can't get my Verizon email on it, has no date book, has no way of adding notes of things to do (simple text app)....so, in addition to my Nook, I also have to carry my ipod (which has a wonderful 'notes' app and can get Verizon email), and my big ole calendar to access my many appointments.  Very disappointed that Nook doesn't have other 'apps' to add to make life a bit more organized."},{"product_id":"1400599997","product_category":"Electronics","review_body":"I spent a long time researching and trying out various eReaders, and 2 months after going with the Nook I am very pleased with my decision. I wanted an eReader for portability and easy access to books, and the Nook delivers in full.     It has a pretty decent battery life (I'd recommend airplane mode unless you're actually downloading), is super simple to load books\/documents from a computer, and looks\/feels great. I'm currently in law school, and have numerous PDFs from various classes loaded onto it. Reading from an eReader is way easier on the eyes than constantly staring at a computer screen (and it costs the same as a single casebook).     I like the Nook's touchscreen interface; it can be a little slow at times, but I haven't had any major issues with it. One of my biggest factors for buying a Nook over a Kindle\/Sony was that Barnes & Noble is a BOOKSELLER. This device is designed with book readers in mind. The fact that I can loan eBooks from the library, read eBooks for free while at Barnes & Noble, and the overall design of the thing (multiple options for turning pages, I like to swipe the touchscreen vs. pushing the buttons) put the Nook far out in front. The fact that Barnes & Noble gives you 2 weeks to try the thing out put it over the edge. I initially bought the Wi-fi only version and it froze after the second day, I exchanged it for the Wi-fi\/3G at the store no questions asked.     Overall it's a great product and awesome for those that actually like books, not just having the latest gadget."},{"product_id":"1400599997","product_category":"Electronics","review_body":"I had every intention of loving this product, however I returned it immediately!  The setup was way too complicated.  If you have ever experienced the ease of an iPad, this will make you feel like you have gone back in time.  I am going to look into the newer Nook and Kindle and see if they have improved the product."},{"product_id":"1400699894","product_category":"Electronics","review_body":"I just got this thing and although it looks nice and feels nice it has limited capacities.  Most importantly I cannot insert a microSD card with my own epubs into it and this is why they gave you more memory. They hide the fact you cannot expand it with the card and charge you more to get less capacity.  I've never been more disappointed with an Amazon purchase and cannot understand why the B&N website doesn't point this out and neither does the Amazon website.  I'm returning mine ASAP and will order the &#34;Simple&#34; model with Glowlight--the &#34;simple&#34; one is more capable.  I am very disappointed in their marketing of this model (deliberately deceitful).  The reason I have liked the B&N readers is their expandability and this trumps the Kindle features in my mind."},{"product_id":"1400699894","product_category":"Electronics","review_body":"I've had my Nook GlowLight for almost a month now. Before purchasing it, I'd already had ebook readers from other major brands. The reason I bought this was because I saw in the ads that it has the auto-hyphenation function. Absolutely true. It has beautiful font types and can automatically hyphenate the text. I know some people may not care about auto hyphenation but it is very important for me as I prefer reading in larger font size. The ebook readers of other brands may be good in other respects but cannot display text as beautifully as Nook GlowLight does, especially when I use larger font size. The reason I have given it four stars is because the light is not even enough on the top of the page. There has been great improvement from Nook Simple Touch with GlowLight to Nook GlowLight in this respect, but there is still room for improvement. In spite of this and other shortcomings, in terms of reading, this is the best."},{"product_id":"1400699894","product_category":"Electronics","review_body":"I  have had several Nooks in the past. THe nook original and the Nook Color. They each had appeal. The original for the E Ink screen. And the Color for the ability to read in the dark. I heard of the Glolight and I was really hesitant to buy another one. Easily one of the best decisions I ever made. It is super light weight. I just love the backlit screen. I thought it would hurt my eyes like staring at a computer screen too long, but the ability to change the brightness eliminates that. It can go from extremely dim and pleasent to so bright you could use it for a dim flashlight.  All in all WONDERFUL device. I am so please with my purchase. The pages turn fast and seamless, and I have never had an issue with it lagging. It has an excellent WIFI connection. All in all, this is my favore tech device.  Thank you Barnes and Noble for creating the perfect reader. For people debaiting between this and a Kindle, defenitely choose Nook. They give you the ability to lend many titles, you can read any book for fre3e whrn inside a B&N store, great customer service, and a free book every friday. Dont get sucked into the KIndle herd. (sorry amazon)"},{"product_id":"1400699894","product_category":"Electronics","review_body":"I love my Nook w\/ Glowlight feature.  It's a real marriage saver.  I've had one for a couple of years, but it got, tragically, stepped on by a student on an overnight bus trip.  I can't sleep without reading, and the room-brightening reading light, since the sad demise of my nook, has brightened our bedroom so much that even I can't drop off well, let alone my husband.  And once I fall asleep, the Nook goes off in only 15 mins after my turning a page, so I don't have a nightlight on.  I charge it about twice monthly.  I'm getting a new one today."},{"product_id":"1400699894","product_category":"Electronics","review_body":"Very nice and light but it does have a habit of freezing if you keep it on for long periods of time."},{"product_id":"1400699894","product_category":"Electronics","review_body":"I can now read books from my public library"},{"product_id":"1400699894","product_category":"Electronics","review_body":"Works like a charm. Light works great. Just the right size and very light weight. Just because it's a nook doesn't mean you're limited to purchasing from Barnes and Noble. A simple google search can help you with the process."},{"product_id":"1400699894","product_category":"Electronics","review_body":"Nook is great ;) It is much faster then the previous version, light is nice and very useful.<br \/>When using nook with light, battery keeps for around 2 weeks."},{"product_id":"193493139X","product_category":"Electronics","review_body":"The product came in on time, included batteries, and is in perfect working condition. Looks just like the picture. Great price too, compared to the others I found."},{"product_id":"193493139X","product_category":"Electronics","review_body":"Best website"},{"product_id":"193493139X","product_category":"Electronics","review_body":"Works fine, but this is less than 3 dollars of electronics.  The company even makes a smartphone app that does this because everyone already owns a device that is capable of what this does."},{"product_id":"193493139X","product_category":"Electronics","review_body":"The only difference is that this one does not have the screen that displays what button you press. The screen is pretty useless unless you really need to be reminded of what button you just pressed."},{"product_id":"193493139X","product_category":"Electronics","review_body":"Very basic device that college students are forced to pay exuberant amounts for because its required for multiple classes. However, it seems to hold its charge very well. I haven't needed to replace batteries and I've been using it daily since late August."},{"product_id":"193493139X","product_category":"Electronics","review_body":"Used it in my Sociology 101 class. The previous owner changed the battery so thumbs up to her!<br \/><br \/>Works like new and i liked how this one had a screen to see what button you pushed and channel you're tuned into."},{"product_id":"193493139X","product_category":"Electronics","review_body":"Fast shipping and exactly what i ordered."},{"product_id":"193493139X","product_category":"Electronics","review_body":"Cheap, not worth asking price by any means."},{"product_id":"3056508193","product_category":"Electronics","review_body":"Only complaint I have is the magnetic washer that is used to manage clicks, is not attached to the box and I lost it somehow...even though it is magnetic...once can still lose ...it should have been attached to the body via some string."},{"product_id":"3056508193","product_category":"Electronics","review_body":"Works perfectly with my GS4.  Experience much better than I had imagined."},{"product_id":"3056508193","product_category":"Electronics","review_body":"My first foray into Google Cardboard, and this got the job done on the cheap. The instructions aren't the most useful, but I used this YouTube video to help me put it together (all cardboards are virtually the same): https:\/\/www.youtube.com\/watch?v=5mSW5GyFozg. I did need to tape the left side since the sticky tape it came with wasn't too strong. I have an iPhone 6 by the way, and I needed to use it with my case in order to keep it from falling out (OEM Apple leather case, though any other case would probably work fine too). It can get a little uncomfortable on the nose, but adding some padding (paper towel or the like) should fix that. By the way, on the iPhone, I'm using an app called 'Mobile VR Station' to watch view videos\/photos, and it's a great app."},{"product_id":"3056508193","product_category":"Electronics","review_body":"Clever design.  I like the small extras of this version like the velcro attachments and head strap."},{"product_id":"3056508193","product_category":"Electronics","review_body":"My son in law loved this gadget- and he's a rocket scientist!"},{"product_id":"3056508193","product_category":"Electronics","review_body":"A great headset to play around with Virtual Reality. The headset itself is surprisingly good even though its made off cardboard.<br \/>The headset works with NDC technology. I was a little bummed out when i found out my phone does not support NFC.<br \/><br \/>I would definitely recommend this product for Virtual Reality beginners."},{"product_id":"3056508193","product_category":"Electronics","review_body":"For the price this is a great way to try out vr. Don't expect this to behave like an expensive, dedicated headset. Easy and fun to assemble. Beautiful in its simplicity."},{"product_id":"3056508193","product_category":"Electronics","review_body":"It works great! Its a really cool effect. No need to buy the $20\/$24 ones as this one works just the same. And it comes with a headstrap, which the other ones don't. If you do decide to get this, just make sure your phone has a gyroscope in it or else the apps will not work properly. I had to buy myself a used phone off of eBay that does have one. Luckily, it was under $30."},{"product_id":"3283005737","product_category":"Electronics","review_body":"Excellent product, the way to the future. Google glass will change the way we process information... Love this nice product already!"},{"product_id":"3283005737","product_category":"Electronics","review_body":"I liked this glass. It is a great product but it may causes some problems in the eyes bcz it needs concentration."},{"product_id":"3283005737","product_category":"Electronics","review_body":"Excellent product. Google glass needs no introduction. Works as advertised and frequent updates are only making them better. Those who can afford it should definitely give it a shot."},{"product_id":"3283005737","product_category":"Electronics","review_body":"great thing!"},{"product_id":"3283005737","product_category":"Electronics","review_body":"I used two pair to work with a friend to design a system for school because I am disabled and can't carry much at all, so if you wanna know.....these were like a gift from Heaven! If you wanna play around, then use your phone......if you want a life changer for a student or anyone dealing with people, files, etc...then open your mind and see how you can change your life!!!"},{"product_id":"3283005737","product_category":"Electronics","review_body":"When I made the decision to spend $1593.75 (including shipping) on my charcoal Glass II Explorer last November, I had expectations for what I could use it for. Here is a report on what those were, what other uses I discovered, and how Glass fared in regard to each use.<br \/><br \/>A better action video camera?<br \/>I had high hopes for Google Glass to be a replacement for my $50 bullet camera with better battery life, better image quality (because of the wide-angle lense) and better operability (because I see what it records and can pause it etc).<br \/>The verdict: Glass fails in this category. The battery life is even shorter (30 minutes tops with a full battery right off the charger). I can wear it under my aero-helmet, but not without feeling pressure. This is a no-go on even the shortest bike rides or runs. The low-light capability is not great, either, and on my night runs with a head light there is not much to see on the resulting video.<br \/>It does not fit under or over ski goggles, and the clear or active shades do not replace goggles (too small and too much draft that will tear up eyes at higher speeds).<br \/><br \/>An in-vehicle or dashboard camera?<br \/>A camera that reliably and continuously records what happens around me when I drive would be great. Glass is promising, because it captures my field of view, including the rear view mirror, but it is not reliable and cannot record continuously. When plugged in, the battery life would be no issue, but there is currently no app that records continuously (and overwrites earlier clips when memory runs out). Also, the display is always on when it records video, which is bothersome at night.<br \/>With a little bit of practice it is possible to wake up Glass and get into video recording mode in a matter of a few seconds, but that is not fast enough in unexpected situations.<br \/>My verdict: I think that the device has potential in this category with the right software. Currently it is limited.<br \/><br \/>A better run\/ride tracker?<br \/>I saw that Strava has Glass apps even before I placed my Glass order, and I uploaded my entire workout history from Garmin to Strava in anticipation of using their apps with Glass.<br \/>The verdict: Glass fails in this category, but my reasoning requires explanation, because admittedly this is the fault of my Nexus 5 and not so much the fault of Glass. Glass relies on the GPS sensor of the phone, and the Strava app only works when the phone is paired. Unfortunately my Nexus 5s GPS sensor data appears to be very inaccurate. When I started a \\\\\"Run\\\\\" on Strava while walking the dog, it placed me some 50 yards away from the road that I was on. I will continue to depend on the good old Garmin 305 in the coming years.<br \/>In addition to issue with GPS accuracy, I don't take Glass on runs because I sweat a lot from the head and both the power button and the bone-conduction speaker would be exposed and allow sweat (or rain water!) to enter the device.<br \/><br \/>A better headset?<br \/>A resounding no here. The bone conduction speaker vibrates and tickles behind my ear. Having longer conversations on Glass is uncomfortable. The sound quality is moderate at best, and many times there is some kind of mechanical obstruction that causes strong distortions, to a point where I cannot understand the other party. I keep my Glass clean and protected, so I am not sure what causes the distortion. Maybe a tiny dust particle is all it takes.<br \/>The ear bud speaker that is now included with Glass is too cumbersome to deal with for me. Glass is already bulky and in the way when you take if off because you can't simply fold it and put it in your shirt pocket. Now having something dangling on a USB cord attached to Glass is a non-starter. I have not even taken the ear bud out of the box yet.<br \/><br \/>A hands-free smart phone controller?<br \/>Being able to control important features of your phone without actually having to look at it or even hold in your hand is a compelling feature. If you use Gmail and Hangouts exclusively, you are being well-served by Glass. You will be alerted by and can read instant messages. and respond to and write instant messages and emails by using the voice recognition that works pretty reliably for me.<br \/>I don't seem to be able to create emails from scratch, only instant messages to one of up to 10 contacts. I do see emails in my Gmail inbox, though. They appear as a new slide in the timeline and I can respond to them without ever touching Glass. This is pretty cool.<br \/>The verdict: Unfortunately, I use neither Gmail nor Hangouts, and I frankly don't get Hangouts. I cannot access emails on my company's Exchange server or my personal IMAP service from Glass, and while I have over 1,000 contacts on my phone, I only see 14 contacts on Glass. This pretty much renders Glass useless as a communication device.<br \/><br \/>A better navigation device?<br \/>I really like the way navigation works. I have one car with a built-in navigation system and will not use Glass there - it certainly does not compete with the Mercedes Comand System. In my other car I do not have a navigation system at all, and previously I had to meddle with the phone when I needed directions. This works so much better on Glass.<br \/>My verdict: Navigation is definitely a compelling use of the product, in the car as well as on the bike or on foot (even though Google Maps lacks trail data). Based on some recent incidents that made national headlines, it appears that there is currently doubt among law enforcement officers whether using Glass while driving is legal and safe. I can attest that it can be surprising and distracting when Glass comes to live in full brightness during a night drive to alert you of an upcoming turn, but I don't find it all that different from having a GPS device in the car that is on all the time.<br \/><br \/>A better music streaming device?<br \/>With access to Google Music and completely hands-free operation through voice-activated searches, Glass offers yet another compelling use.<br \/>My verdict: Exciting possibilities, but currently we have to compromise on either poor audio quality or complicated handling\/wiring of ear buds. The mono ear bud that comes with Glass is, well, mono only; stereo ear buds are available for an extra $85, and my ears aren't made for ear bud-type headphones anyway. They tend to hurt and fall out, and the same is true for the ear bud that came with Glass. Overall, I am somewhat indifferent about Glass' current usefulness as a music streaming device.<br \/><br \/>Other uses?<br \/>Glassware can be installed from the phone or the computer. The current selection of applications that work with Glass is limited (I just counted 35), which I find surprising, given how long Glass has been available to the development community already.<br \/>My verdict: The speed of adoption among application developers seems to be slow and the number of available applications is small. I am confident that this will change. Still, no more than a null-vote on other uses at this time.<br \/><br \/>A mature and well-tested device?<br \/>I run into odd and unexpected situations with Glass almost daily that require some tinkering to figure out. Examples?<br \/>*The on-head detection is flakey and sometimes shuts off Glass unexpectedly. I figured this out myself and the chatter on the Explorer forums confirmed my diagnosis. I just disabled this feature entirely.<br \/>*The \\\\\"Ok Glass\\\\\" command stopped working on the 3rd day. I had to do a factory reset to get it back.<br \/>*When I did a factory reset, it took several attempts and an uninstall of the MyGlass app on the Nexus 5 before I was able to pair them again. Glass would just not get into pairing mode.<br \/>*Currently, phone calls or navigation don't work while on a Wifi connection, even though I am paired and connected with the Nexus 5. There is no way to \\\\\"disable\\\\\" the wireless connection temporarily. You have to make Glass \\\\\"Forget\\\\\" the connection to make a call and then recreate it. The phone reports the Bluetooth profile \\\\\"Phone Audio\\\\\", not \\\\\"Headset\\\\\" as one would expect.<br \/>*I am perpetually confused by what contacts I get to see on Glass. I understand that I can add up to 10 contacts from my phone that will show up on Glass as separate slides. So far I added 5 contacts. When I want to make a phone call, I am presented with 14 contact choices, though, the same people that appear in my Hangouts on Google. With half of them I have had no contact in years and I don't have the slightest idea how they ended up there.<br \/><br \/>My overall verdict:<br \/>The head-mounted display and its possibilities are exciting and an indication that this technology will become pervasive in the very near future. But Glass appears to still be an experimental device that does not excel in any particular discipline, comes with a high price tag, and that non-techie consumers will struggle with. The short battery life severely limits its practical use and spoils the fun.<br \/>I no longer keep my Glass charged and use it maybe once a month. It still works as a conversation-starter. If you expect anything more than that, you will be disappointed.rough voice-activated searches, Glass offers yet another compelling use.<br \/>My verdict: Exciting possibilities, but currently we have to compromise on either poor audio quality or complicated handling\/wiring of ear buds. The mono ear bud that comes with Glass is, well, mono only; stereo ear buds are available for an extra $85, and my ears aren't made for ear bud-type headphones anyway. They tend to hurt and fall out, and the same is true for the ear bud that came with Glass. Overall, I am somewhat indifferent about Glass' current usefulness as a music streaming device.<br \/><br \/>Other uses?<br \/>Glassware can be installed from the phone or the computer. The current selection of applications that work with Glass is limited (I just counted 35), which I find surprising, given how long Glass has been available to the development community already.<br \/>My verdict: The speed of adoption among application developers seems to be slow and the number of available applications is small. I am confident that this will change. Still, no more than a null-vote on other uses at this time.<br \/><br \/>A mature and well-tested device?<br \/>I run into odd and unexpected situations with Glass almost daily that require some tinkering to figure out. Examples?<br \/>*The on-head detection is flakey and sometimes shuts off Glass unexpectedly. I figured this out myself and the chatter on the Explorer forums confirmed my diagnosis. I just disabled this feature entirely.<br \/>*The \\\\\"Ok Glass\\\\\" command stopped working on the 3rd day. I had to do a factory reset to get it back.<br \/>*When I did a factory reset, it took several attempts and an uninstall of the MyGlass app on the Nexus 5 before I was able to pair them again. Glass would just not get into pairing mode.<br \/>*Currently, phone calls or navigation don't work while on a Wifi connection, even though I am paired and connected with the Nexus 5. There is no way to \\\\\"disable\\\\\" the wireless connection temporarily. You have to make Glass \\\\\"Forget\\\\\" the connection to make a call and then recreate it. The phone reports the Bluetooth profile \\\\\"Phone Audio\\\\\", not \\\\\"Headset\\\\\" as one would expect.<br \/>*I am perpetually confused by what contacts I get to see on Glass. I understand that I can add up to 10 contacts from my phone that will show up on Glass as separate slides. So far I added 5 contacts. When I want to make a phone call, I am presented with 14 contact choices, though, the same people that appear in my Hangouts on Google. With half of them I have had no contact in years and I don't have the slightest idea how they ended up there.<br \/><br \/>My overall verdict:<br \/>The head-mounted display and its possibilities are exciting and an indication that this technology will become pervasive in the very near future. But Glass appears to still be an experimental device that does not excel in any particular discipline, comes with a high price tag, and that non-techie consumers will struggle with. The short battery life severely limits its practical use and spoils the fun.<br \/>I no longer keep my Glass charged and use it maybe once a month. It still works as a conversation-starter. If you expect anything more than that, you will be disappointed."},{"product_id":"3283005737","product_category":"Electronics","review_body":"Perfect, Perfect, Perfect! The best customer service I have ever had!!!!"},{"product_id":"3283005737","product_category":"Electronics","review_body":"DO NOT BUY THESE GLASSES USED. SOME SELLERS ARE EVIL IN STATING THEIR GLASSES ARE NEW BUT ARE USED. IF THE SEAL IS BROKEN ITS USED.<br \/><br \/>And as a beta tester i cannot honestly recommend this yet for retail sale to the general tech public. this beta form google glass are, generally, for technology reviewers, developers and programmers and not currently ready for the general public.<br \/><br \/>the glass does not have all the functions. there are numerous software glitches and its not for your average tech user. it has a high learning curve and the frame is easily bent or it can be bent or damaged very easily. And the computer side of the glass frame gets hot, very fast, making the side of your heard sweat or burn a little from overheating due to a lack of proper ventilation. note: this is a beta form glass computer camera so its missing a lot of FULL retail functions and capabilities!<br \/><br \/>to reiterate, WARNING: ITS NOT A RECOMMENDED BUY. WAIT FOR THE COMPETITION AND\/OR full RETAIL VERSIONS.<br \/><br \/>ALSO some deceptive SELLERS ARE SELLING their used glass WITH MISSING PARTS.<br \/><br \/>THESE GLASSES ARE ALL IN BETA FORM AND THEREFORE ARE MISSING many normal retail FUNCTIONALITIES. and some DEVIOUS SELLERS ARE TRYING TO CASH-IN ON YOUR STUPIDITY so they can BUY NEWER RETAIL GOOGLE GLASSES or competitor glasses. AND THE RETAIL VERSION WILL BE MUCH CHEAPER! AND COMPETITION FROM SAMSUNG APPLE, MICROSOFT WILL MAKE THIS GOOGLE GLASS OBSOLETE. And the $1500 glasses are very overpriced if they are factory sealed new. And an absolute fraudulent rip off for used glasses that are selling near $1000. And on google's official website shop, the glass sells for exactly at $1500. these scums are ripping you off. BUYER BEWARE! THERE ARE DIRT BAG CON SELLERS IN WHICH AMAZON FAILS TO SCORN!<br \/><br \/>Used glasses is worth or valued at no more than $300 because of its easy extensive wear and tear uses or unknown mishaps from previous owners, yes people seriously lie about their used products for sale! to reiterate, Do NOT buy or lose your money. instead go buy 2 gopro 4 blacks or 2 new xbox one's or 2 new ps4 or mix and match for a better value for longer residual value, longer enjoyment and bang for your buck!their used products for sale! to reiterate, Do NOT buy or lose your money. instead go buy 2 gopro 4 blacks or 2 new xbox one's or 2 new ps4 or mix and match for a better value for longer residual value, longer enjoyment and bang for your buck!"},{"product_id":"3744295508","product_category":"Electronics","review_body":"only had it for a few weeks but have not noticed one problem for this price compared to other hdmi cables i feel like I won big on this item."},{"product_id":"3744295508","product_category":"Electronics","review_body":"Product arrived as promised and seems to work fine. Great price on this product as the big box stores charge much more for a product that really does not perform any better.  Good Value for the money."},{"product_id":"3744295508","product_category":"Electronics","review_body":"I don't have too much exciting to say about the cable.  I'm not a videophile by any means, but the cable works, I don't see any problems with it, and it is a bunch cheaper than I could get from Best Buy..."},{"product_id":"3744295508","product_category":"Electronics","review_body":"Worked fine for a week, thereafter started skipping video feed. the audio is not interrupted, but the video goes blank every 10 seconds for 3-4 seconds. beware of this inferior product"},{"product_id":"3744295508","product_category":"Electronics","review_body":"Great cable and just as good as others i have spent hundreds of dollars on. You cannot beat this price. I recommend this cable."},{"product_id":"3744295508","product_category":"Electronics","review_body":"Purchased this a few years ago and forgot to write a review. Needless to say I'm still using it and have no problems. I purchased this back when the cheapest HDMI cord was $30.00. Great buy, I recommend it."},{"product_id":"3744295508","product_category":"Electronics","review_body":"I did not need an HMDI cable at this time, but could not resist the price."},{"product_id":"3744295508","product_category":"Electronics","review_body":"This seller was recommended to me by a personal Friend. The best deal anywhere, product is exactly as described and works well!"},{"product_id":"7564005068","product_category":"Electronics","review_body":"bought this to interface a USB-serial cable with the serial port on an Agilent 34401A DMM since this model doesn't have USB support. Works great so i bought two more for all DMMs in the lab"},{"product_id":"7564005068","product_category":"Electronics","review_body":"Good price and good quality This was worth the money by far. 8 7 6 5 4 3 2 1."},{"product_id":"7564005068","product_category":"Electronics","review_body":"How do you begin to quantify a null?<br \/>Do I love it? No. That’s 5 stars. Do I like it? Yes. That’s 4 stars.<br \/>To rate the quality of this null we must first define the null.<br \/>There is a “null hypothesis”. There is “nullification”. There is a “nullification crisis”.<br \/>In short, the “null hypothesis” refers to a general or default position: that there is no relationship between two measured phenomena. In the case of the Null Modem Adaptor it would appear that it invalidates its own existence. But. There it is.<br \/>Let’s skip to the “nullification crisis”. South Carolina's 1832 Ordinance of Nullification. A long boring story that totally misses the point.<br \/>So, what about nullification? State nullification is the idea that the states can and must refuse to enforce unconstitutional federal laws. Now that’s interesting reading but I don’t think it applies.<br \/>The “null modem adaptor” exists because no one can understand a word of this Wiki reference: ([...]<br \/>It exists due to the inherent incompetence of humanity.<br \/>The quality of this null modem adaptor is invaluable. It is in itself a shrine to the quality of life. Since no one ahead of me can understand where pins 2 and 3 go and tell me that the reason it don’t work is my fault, this lowly little piece of hardware that tries by definition to invalidate itself allows me to confirm my existence and walk away. It is: The Null Modem Adaptor.<br \/>Don’t leave home without one."},{"product_id":"7564005068","product_category":"Electronics","review_body":"This is a good tool to have and comes at a good price.  It was also clearly labeled, which might otherwise be a problem if you have more than one of these short adapters."},{"product_id":"7564005068","product_category":"Electronics","review_body":"Ok"},{"product_id":"7564005068","product_category":"Electronics","review_body":"Excellent quality."},{"product_id":"7564005068","product_category":"Electronics","review_body":"This is the perfect size and it was exactly what I needed.  It was also 1\/5 the price of what the nearby shack chain wanted!  With free shipping, how could I pass it up?  BTW - I did not know that the missing pin 9 is normal for almost all null modem adapters.  A nice reply from the seller and some follow-up research confirmed it, so don't let it scare you when you see it!"},{"product_id":"7564005068","product_category":"Electronics","review_body":"The DB9 Male\/Female null model is great product for the money! It works and can fit in any computer bag without taking a space as standard cable would do!"},{"product_id":"7793224531","product_category":"Electronics","review_body":"Will be buying several more of these - cannot believe how well made and inexpensive this cable is.  Very Heavy Duty!"},{"product_id":"7793224531","product_category":"Electronics","review_body":"quick shipping works fine for what i needed and saved me money"},{"product_id":"7793224531","product_category":"Electronics","review_body":"For a few bucks this product was GREAT. for any xbox buyers i recommend this over buying a Microsoft xbox HDMI cord for 30-40 bucks. shipping was prompt but i will say this was NOT 2 meters as said in the description, 2 meters is close the 6 feet and this was about 3 feet long."},{"product_id":"7793224531","product_category":"Electronics","review_body":"Works perfect and priced really well.  No need to buy the high cost products from your local electronic store.  These work fine."},{"product_id":"7793224531","product_category":"Electronics","review_body":"It does its job. Looks and feels cheap but it works fine. Ide buy it again"},{"product_id":"7793224531","product_category":"Electronics","review_body":"Is easy to install and makes everything look good on tv And I also use it for my xbox and ps3 and it makes thing look pretty"},{"product_id":"7793224531","product_category":"Electronics","review_body":"I ordered this hdmi cable because it was so inexpensive AND  the shipping was so reasonable.  The cable is everything it is supposed to be.  Works just as well as MUCH more expensive cables. I will definitely purchase from this source again."},{"product_id":"7793224531","product_category":"Electronics","review_body":"Purchased this a few years ago and forgot to write a review. Needless to say I'm still using it and have no problems. I purchased this back when the cheapest HDMI cord was $30.00. Great buy, I recommend it."},{"product_id":"7799813393","product_category":"Electronics","review_body":"I bought this item when I was running windows 7 and it worked fine.  I am now running windows 8 I tried to use it again and it doesn't work.  I contacted the software provider (Honestech) their response was &#34;The software (VHS to DVD 3 SE) was modified by a third party (mygica.com) therefor Honestech did not support it.  I contacted the hardware provider they did not even have the courtesy to reply.  It apparently needs a new driver but no one has."},{"product_id":"7799813393","product_category":"Electronics","review_body":"It doesn't have the best video capture even with the newest VHS tapes I own. Home movies (even digitally recorded ones) come out really grainy."},{"product_id":"7799813393","product_category":"Electronics","review_body":"This product is listed under the wrong title. It should be listed as &#34;honestech VHS to DVD 3.0 SE.&#34; This product does not work. The product website doesn't even list this version of the product amongst its legacy products. Why is Amazon listing a product that has no support and doesn't work?"},{"product_id":"7799813393","product_category":"Electronics","review_body":"This works as advertised and has allowed me to digitize several VHS tapes that needed preservation.  Great to be able to take old video and incorporate it into PowerPoint or to make DVDs for family."},{"product_id":"7799813393","product_category":"Electronics","review_body":"The EZGrabber2 works well but it's software is a little lack luster. I have software installed on my computer that works properly with my night vision so the EZgrabber works well to do what I needed."},{"product_id":"7799813393","product_category":"Electronics","review_body":"A little background...I am a 38 year old man who has played around with electronics and computers my entire life. Windows 7-64bit machine with 8GB RAM blah,blah,blah.<br \/>I have struggled well over a month with this piece of trash. After this experience I'm DONE with Micro$oft's depending on consumers to fix there crap OS and heading to Costco to let other computers do what this device clearly will not."},{"product_id":"7799813393","product_category":"Electronics","review_body":"it works fine"},{"product_id":"7799813393","product_category":"Electronics","review_body":"This was an easy product to work with and got my videos on to CDs in an uncomplicated way. Easy to use. I would recommend it."},{"product_id":"9756663855","product_category":"Electronics","review_body":"I bought this for my two daughters (7 & 8at the time) for last Christmas.  They were not excited about it.  They tried it once and could not keep up.  They felt very frustrated and never played it again.  The music and graphics stink."},{"product_id":"9756663855","product_category":"Electronics","review_body":"Started out as fun (although pretty primitive and basic).  Can't really say much more about this product yet, though, because after a couple of plays it stopped working correctly and we returned it for a replacement.  Still awaiting the replacement; hoping to receive it soon because the kids are all out of patience!  One other comment, re. set-up - we have an older TV and the only way I could get it to work was to plug it into the front jacks of my DVD player (which was hooked up to my TV) and then toggle through the various input options until it showed up on the screen - not exactly the simple plug and play I'd hoped for.  Also, this product seems to work best on a hard floor, not as well on carpet; bummer for us because our TV room has carpet."},{"product_id":"9756663855","product_category":"Electronics","review_body":"This is so much fun.  My children and I used to go the arcade at the local mall and the DDR machine was one of my personal favorites.  Then the arcade closed for good and I was missing my exercise. Besides, the game was usually already being played so I ended up waiting lots of times.    But this game is terrific and no waiting.  I can turn on my TV and play anytime.  I don't need a game console or any other expensive equipment.  Make sure you wear a pair of socks while playing so your feet don't stick to the pad and don't worry about the smell of the vinyl - it subsides.  A few pieces of duck tape folded so the a sticky surface is exposed on both sides took care of the pad moving on the floor.  I highly recommend this item.  Can't be beat for the price!"},{"product_id":"9756663855","product_category":"Electronics","review_body":"Okay, first thing's first. Don't get it! Me and my brother put about $60 together to buy it because the one for gamecube was to expensive and my other brother didn't want me to buy one for his Xbox. So we decided to get it for the T.V. It Stinks! The only thing good about it is that it works. The graphics on the pad is better than the graphics on  T.V. It looks like a Arcade game from the 70's. The graphics are to tell you the truth. Here are some pros and cons about it.<br \/><br \/>Pros:<br \/><br \/>- The pad is good<br \/><br \/>Cons:<br \/><br \/>- The graphics are bad<br \/><br \/>- No words in the songs<br \/><br \/>- Sounds like ring tones<br \/><br \/>- about 50 minute long songs<br \/><br \/>- Good for about 5 seconds<br \/><br \/>In the end I only gave it a 3 because it looks good. But they are ripping you off. Please don't get it. Get it for anything else. Please don't get it. It's terrible."},{"product_id":"9756663855","product_category":"Electronics","review_body":"Now this product was purchased about 3 years ago, but it's still going strong. Me and my girls have a blast trying to keep up with the steps. This product has always been a whole lot of fun for my entire family...it'll help lose a few pounds if you keep at it."},{"product_id":"9756663855","product_category":"Electronics","review_body":"We were a little disappointed with the DDR system.  The pad moves around alot and gets all wrinkled up.  The positive is that you get a really good work-out.  We were also very upset that we didn't receive the one we ordered and the seller didn't care.  Might be our last online purchase for while."},{"product_id":"9756663855","product_category":"Electronics","review_body":"Well I did buy the game and if you are going to work out its a fun thing to did but if you have a x box are a Playstation  it will be good to buy it for that. But the TV is not that bad but if I had a xbox or a playstation I wood have get it for one of them but if you are trying to loss weight and do not have one of the game system the TV is good but there is something I did not like about it  The graphics are bad and no No words in the songs. But like I said it good for working out. and that way I will give it 3 star."},{"product_id":"9756663855","product_category":"Electronics","review_body":"great exercise for the kids, instead of being braindead in front of the computer!!! pad moves around a little on the carpet, a little difficult for the under 8 population; would recommend for people without a system like play station,etc."},{"product_id":"9888002198","product_category":"Electronics","review_body":"Worked just fine for my vacation but by the end of a 2-week trip to Europe it was starting to show signs of wear. But great value for money - does what it promises to do but remember the more unplugging & replugging you do, the more 'delicate' it gets"},{"product_id":"9888002198","product_category":"Electronics","review_body":"Ordered Sept. 2012 from another company on Amazon for $5.24 which included shipping. I sent it with a gift to someone in the UK.<br \/>Item is finished well, the different interlocking plugs cleverly designed and fit together snugly. Came with instructions and carrying pouch.<br \/>Only trouble I had when testing it here before sending it was pushing my computer's power cord plug into the AC receptacle. Very difficult at first to force it without it seeming it would break but after many tries finally got it.  Much easier after that.<br \/>The USB slot and its light worked, but the second light for the AC receptacle did not. However, the receptacle worked fine and charged my computer through it.<br \/>The USB light did not go off when the device charging through it was fully charged. Also, another switch was shown in the instruction diagram (I don't remember what it was supposed to be for) that wasn't on the adapter.<br \/>Recipient uses the USB slot to charge a camera and MP3 player and reports it is working fine for those devices. Thrilled to have the EU plug too.<br \/>If it lasts, great product and VERY cost effective."},{"product_id":"9888002198","product_category":"Electronics","review_body":"This is a good product that worked fine on a recent two week trip to Italy.  I especially liked the USB option as it was handy for today's electronics.  The unit isn't the most compact but is very tranformer like to accomodate multiple outlet configurations."},{"product_id":"9888002198","product_category":"Electronics","review_body":"This adapter has to be the most useful thing I have bought in the past year. I came to Grenada, West Indies, for school, and found this adapter to be perfect for all my needs. I find that I can use the AC adapter as well as the USB adapter. Grenada uses the UK socket type and this fits perfectly. This adapter even came with an extra fuse, which I didn't even realize was there until there was a small surge. At first, I thought I had lost full functionality, then I opened the front compartment to find a replacement fuse. Absolutely perfect!! I am without a doubt 100% satisfied with this purchase. This adapter works for UK, Europe, Australia and more. Look forward to using it for quite some time."},{"product_id":"9888002198","product_category":"Electronics","review_body":"We bought these for our Honeymoon to Spain and they worked very well.  I could not BELIEVE the CRAZY amount of Money Brookstone wanted for these.....I can buy 6 of them here for the price of one of theirs!  They have a lot of options on them to accommodate many different energy supplies in different countries."},{"product_id":"9888002198","product_category":"Electronics","review_body":"Perfect for travel"},{"product_id":"9888002198","product_category":"Electronics","review_body":"Works fine for stationary object.  Don't use for hair products that move (i.e. flat iron, hair dryer).  It is loose."},{"product_id":"9888002198","product_category":"Electronics","review_body":"I needed one for the first time when I was in an international airport; but the prices there were out of the hook!! Almost exactly the same product from an airport cost around $25! So, who got stuck for hours without internet connection? Me. First thing I did after arriving home was ordering one of these so I could use the appliances, bought from abroad, in the US; and it works like magic :)"},{"product_id":"9966559760","product_category":"Electronics","review_body":"I bought this thing to use with my Samsung galaxy S3 mini. It has the same port as the galaxy S3  and it didn't worked. I went to bestbuy to check how was this different to the original. The original has an hologram sticker on the box. This thing is Chinese cheap plastic."},{"product_id":"9966559760","product_category":"Electronics","review_body":"This is a sleek looking product but it does not perform very well.  It may be that what I received is a partially defective item, but it will only work on one TV and not on any others.  This picture quality on HD is OK at best."},{"product_id":"9966559760","product_category":"Electronics","review_body":"Could not get this to work with my Samsung Galaxy S3 and my HDMI television, so I returned the device."},{"product_id":"9966559760","product_category":"Electronics","review_body":"This product is garbage. Had issues from the start, then at the end it came apart. Feels and looks cheap. Even though it came in a Samsung package it makes me want to think that is a cheap Chinese copy (no offense to anyone)"},{"product_id":"9966559760","product_category":"Electronics","review_body":"This adapter is awesome. It works as described, plug it in and enjoy. The options are endless. Shipped quick. Samsung hologram and all. I'm actually typing all this while mirroring my screen onto my Vizio."},{"product_id":"9966559760","product_category":"Electronics","review_body":"UPDATE - the cheap piece of sh1t doesn't work any longer.  The micro usb end wont connect with my device.  It lasted a whole month.  DO\\\\\" NOT BUY THIS JUNK!!!<br \/><br \/>It worked as advertised, but the cheap plastic around the usb end keeps breaking.  Pathetic really.  You'd think you shouldn't have to get out the electrical tape the first time you use the thing."},{"product_id":"9966559760","product_category":"Electronics","review_body":"I tried outher converters but this one really works I can use my phone as a media device and play movies on my TV' with no WiFi connection GREAT"},{"product_id":"9966559760","product_category":"Electronics","review_body":"POSITIVE"},{"product_id":"9981724742","product_category":"Electronics","review_body":"1 plug in the tv and one in the blue ray disc,couldn't be simpler and gives great fidelity"},{"product_id":"9981724742","product_category":"Electronics","review_body":"I bought this to hook up my BD player to my HDTV and it didn't work.  I tried another HDMI cable and it worked perfectly."},{"product_id":"9981724742","product_category":"Electronics","review_body":"A couple of cents for this great HDMI cable have no comparison. Works like an expensive one."},{"product_id":"9981724742","product_category":"Electronics","review_body":"had a monster cable thats WAY MORE expensive, hook-up to my blu-ray player replaced with this  cable, can't really tell the difference visually, but the audio is obviously better."},{"product_id":"9981724742","product_category":"Electronics","review_body":"There's no reason not to buy this cable. The shipping packaging was great and the cable came intact. Picture is perfect, sound is at 95% perhaps, but still good enough."},{"product_id":"9981724742","product_category":"Electronics","review_body":"The cable is a cheep cable, but you get what you pay for.<br \/>The picture is not what there say for the quality."},{"product_id":"9981724742","product_category":"Electronics","review_body":"Great Product, fast shipping!"},{"product_id":"9981724742","product_category":"Electronics","review_body":"I've ordered the HDMI 1.4 cable for a 3D hd, but got it, pretty quick tho, the label says version 1.3 (not 1.4). I haven't tried for the 3D yet, so don't know if the label is wrong or the cable itself."},{"product_id":"9981739588","product_category":"Electronics","review_body":"Product has functioned properly with my Canon T2i for six months now.  I use the cable with a Panasonic brand HDTV by inserting directly into the TV.  I have used the following functions without any problems:  1. Viewing photos  2. Viewing videos with audio  3. Capturing photos using the TV for Live View feedback  4. Capturing videos using the TV for Live View feedback  The cable has had no problems after six month's of general use (probably has been used twenty times)."},{"product_id":"9981739588","product_category":"Electronics","review_body":"This could be a good product because other HDMI cables I've tried did not work with the Canon 7D and HD monitor. It's either the shielding on individual cables were not good or what on other cables. This one works just fine. The cable has good flexibility. Connectors fit well.     One downside is the mini-hdmi connector is too delicate and was barely yanked out and broke.    So if you have good hands and be careful, this one is cheap and it works."},{"product_id":"9981739588","product_category":"Electronics","review_body":"Before I have a second tought to buy this product because it is cheap i was thinking low quality and maybe it's not works to my 7d camera but i was wrong it turned out it's works well it's delivered real 1080p."},{"product_id":"9981739588","product_category":"Electronics","review_body":"Well as far as cables go it is a well made HDMI I recommend it."},{"product_id":"9981739588","product_category":"Electronics","review_body":"I'm sure there's a \\\\\"serious videophile\\\\\" who'll claim to see some difference on his TV when using solid gold, jewel encrusted cables sheethed in the braided hairs of the firstborn daughters of a small town outside Vienna, but they're lying. HDMI carries a digital signal which is not subject to \\\\\"noise\\\\\" or signal degredation like analog cables. This cable works very well for me and is well constructed. Most importantly, it fits my Canon Vixia HF200--the sole reason I bought it."},{"product_id":"9981739588","product_category":"Electronics","review_body":"I'm using this to view pictures and video from my \\\\\"point and shoot\\\\\" camera. The cable is very good for short money, the pictures in HD through the HDMI cable are wonderful."},{"product_id":"9981739588","product_category":"Electronics","review_body":"Just to give you a brief history, I had contacted CITI electronics before buying this product, if it is going to be compatible with my Canon HF200 video camera. Their response; YES. Considering how much the original one costs, I went the cheaper route; and it bit me right back. THIS CABLE DOES NOT WORK. Citi electronics lied (Just another California bases electronics retailer selling Chinese junk). Now, they expect me to pay for shipping even if the product is defective. Wonder if Amazon even goes through a selection process anymore. Overall, a very very bad experience. Never buying anything from Citi electronics again. Will have to buy original canon cable. There should be a way of actually making it zero star."},{"product_id":"9981739588","product_category":"Electronics","review_body":"This cable for under $7 was every bit as good as the ones sold in camera stores for $40+ dollars.  I'm very happy with my purchase."},{"product_id":"9981739677","product_category":"Electronics","review_body":"Works perfectly. Couldn't beat it for the price. Very satisfied with my purchase."},{"product_id":"9981739677","product_category":"Electronics","review_body":"The HDMI cable that Canon endorsed was a bit pricey. This alternative is a good, cheaper choice."},{"product_id":"9981739677","product_category":"Electronics","review_body":"Great product that performs very well. This is a great buy at a great price and I would highly recommend it"},{"product_id":"9981739677","product_category":"Electronics","review_body":"I have not used this item yet.  I am sure it will work ok.  I did plug it in to the camera and<br \/>it fit well."},{"product_id":"9981739677","product_category":"Electronics","review_body":"Good connection with good quality pictures between my DVD player and TV."},{"product_id":"9981739677","product_category":"Electronics","review_body":"the frist one was a dud(murphy law)- cmple - jump on it sent out a replacement and it works , will<br \/>buy off cmpl again , good product..."},{"product_id":"9981739677","product_category":"Electronics","review_body":"Perfect for hooking up SLR Video Camera to the HDTV."},{"product_id":"9981739677","product_category":"Electronics","review_body":"I just tested the performance of this cable with my Canon S100 and Nikon D90 cameras. It works exactly as expected. I honestly don't understand how this cable sells for less than $3 including shipping and the functionally identical Canon cable sells for almost $49. Who, in their right mind, would choose to pay 16 times as much for a brand name that doesn't do any more for you than this one?<br \/><br \/>Although it looks just fine, this off brand might not hold up under hard use. If that turns out to be the case, I will revise my review."},{"product_id":"9983891204","product_category":"Electronics","review_body":"Excellent"},{"product_id":"9983891204","product_category":"Electronics","review_body":"works exactly as advertised. connects tablet to tv through hdmi. clear picture on tv no lines or artifacting. great cable"},{"product_id":"9983891204","product_category":"Electronics","review_body":"What pay $50 for a Canon brand cable when you can get this one for under $10 and the quality is just as good. I highly recommend this mini HDMI cable."},{"product_id":"9983891204","product_category":"Electronics","review_body":"Works flawlessly to connect my new Canon camera to all the HD TVs that I have hooked it to.  Great pics and vids and sound."},{"product_id":"9983891204","product_category":"Electronics","review_body":"I bought this cable as an alternative to the original Canon HTC-100 HDMI cable for my EOS 60D. I returned the Canon cable which costs 70$ to the store and kept this one. It looks as good as the the Canon one in terms of build quality. It is made in China like the Canon one. I connected it to my TV and it works fine. I can now use the TV as a large viewfinder. There is a delay of few seconds when I switch from the camera viewfinder to the TV but I hardly think this has to do with the cable. It is most probably the TV trying to switch from \\\\\"no signal\\\\\" to signal received. Once the signal was received, the TV screen showed 1080i in the corner and I could see on the TV whatever was on my little 3\\\\\" camera screen. Video and audio recording and replay worked fine.   My recommendation is get this cable instead of the 70$ Canon one."},{"product_id":"9983891204","product_category":"Electronics","review_body":"Very good and normal quality. You can use it instead of originals. cheap. suitable for Canon SX40HS. I haven't more words but the site required more words so I wrote that ;)"},{"product_id":"9983891204","product_category":"Electronics","review_body":"We use this cable to hook our camera to the RV TV.  Works well and is long enough to be able to see at a table and operate the device.  The photos look nice on a large screen."},{"product_id":"9983891204","product_category":"Electronics","review_body":"Very Good buy.  Best price, and delivery outstanding"},{"product_id":"9983891212","product_category":"Electronics","review_body":"This item description is misleading.the small end of the cable is not the same as pictured and does not fit the port on my tablet."},{"product_id":"9983891212","product_category":"Electronics","review_body":"I tried this on both my digital camera and my tablet, and got no signal out to my Panasonic plasma tv. I tried another HDMI adapter, and it worked on both of my devices. It may work for you but it didnt work for me."},{"product_id":"9983891212","product_category":"Electronics","review_body":"Pros:<br \/> - High speed<br \/> - 3D supported<br \/> - Great picture<br \/><br \/>Cons:<br \/> - A few inches to reach my TV from my computer.  Haha!<br \/><br \/>It works great, has excellent picture quality and is very light."},{"product_id":"9983891212","product_category":"Electronics","review_body":"This was an error,however I shall keep it for a possible use,I find that the layman's description of the plug ids are lacking"},{"product_id":"9983891212","product_category":"Electronics","review_body":"Maybe mine is defective.  Another review said it worked with his Asus.  Did not work at all with my Asus Eee Slider or my Arcos Tablet.  I tried it on two different TVs and a computer monitor with both devices and it seemed like a really bad connection. Maybe there is interference because of the the length?  I was very dissappointed.  My husband bought a cable for a couple of dollars more from a different seller, and it works as expected."},{"product_id":"9983891212","product_category":"Electronics","review_body":"Just as good as the $80 one. Picture was the same. I have 60&#34; hd and the pictures and video was the same. Don't spend the money on the $80 one"},{"product_id":"9983891212","product_category":"Electronics","review_body":"Fast ship, great price, quality cable, works great (Only 5% ($4) of the cost of the \\\\\"Canon\\\\\" brand camera cable)...Canon wanted $80 for the same cable (maybe only a 6' length ?)"},{"product_id":"9983891212","product_category":"Electronics","review_body":"10' length, well made, no surprises great value. I'm always leary of cheap products but this met my expectations. Great value."},{"product_id":"9983891719","product_category":"Electronics","review_body":"works"},{"product_id":"9983891719","product_category":"Electronics","review_body":"It's a cable. Plugs into what I want like it should. Price was very good, delivered on time."},{"product_id":"9983891719","product_category":"Electronics","review_body":"i ordered a original Panasonic cable not a substitute ??? and i didnot get it ?"},{"product_id":"9983891719","product_category":"Electronics","review_body":"Not much to say here. It is what it is and works as expected. No problems at all. I guess the critical issue is that the description was accurate in that this product is compatible with my camera as indicated.  Shipping was fast too."},{"product_id":"9983891719","product_category":"Electronics","review_body":"I use this for  something, but forget where. Obviously it works fine oh yes, my video camera to my tv. iT  IS ON hdmi 2"},{"product_id":"9983891719","product_category":"Electronics","review_body":"this seems to work fine."},{"product_id":"9983891719","product_category":"Electronics","review_body":"Great cable. Well built and durable. 10 footer is excellent!"},{"product_id":"9983891719","product_category":"Electronics","review_body":"It is exactly what I wanted. It is easy to connect my Camcorder to my TV and provides the desired results. It arrived in a very timely manner."},{"product_id":"998504780X","product_category":"Electronics","review_body":"great"},{"product_id":"998504780X","product_category":"Electronics","review_body":"Premium"},{"product_id":"998504780X","product_category":"Electronics","review_body":"Worked as advertized, thanks."},{"product_id":"998504780X","product_category":"Electronics","review_body":"Using this to extend video range to a projector.<br \/>Runs through the attic and the signal is strong<br \/>and clear.  What a great deal.  WHY PAY MORE???"},{"product_id":"998504780X","product_category":"Electronics","review_body":"The price was right and I get it right time !!!!! I would recommend this to all the people that I know ..."},{"product_id":"998504780X","product_category":"Electronics","review_body":"Good cheap long cable that actually backs up most of the capabilities, the 3-d came in a little shadowy and Ethernet signal would not either.."},{"product_id":"998504780X","product_category":"Electronics","review_body":"great value"},{"product_id":"998504780X","product_category":"Electronics","review_body":"Does what it says it does for a great price!"},{"product_id":"9985602560","product_category":"Electronics","review_body":"I paid almost $9 dollars for this cable and i cant even use it. I dont know if it dont work or if its the wrong cable. I have Samsung Galaxy Tab 2 7.0 with dock system, However this cable does not work at all on the dock for the samsung galaxy tab 2 7.0, I wasted $9 that i cant afford to toss away. im very dissapointed. It says that this hdmi cable is for galaxy tab. Am I missing something here, can someone explain why?"},{"product_id":"9985602560","product_category":"Electronics","review_body":"Product did not work i was happy to get the wire to connec  my kindle to the tv<br \/><br \/>  !!!!!!! WHAT A LET DOWN !!!!!!"},{"product_id":"9985602560","product_category":"Electronics","review_body":"It wasnt the right cord so I gave it away and the person I gave it to said it works good"},{"product_id":"9985602560","product_category":"Electronics","review_body":"Built well great for tv or home theatre applications snug fit for tv or receiver can't beat the price of it"},{"product_id":"9985602560","product_category":"Electronics","review_body":"Good"},{"product_id":"9985602560","product_category":"Electronics","review_body":"The product did not fit my Galaxy Tab2 - so I may have mis-understood the product listing thinking &#34;mini&#34; referred to the mini-connector on my tablet. Vendor took friendly, immediate action and solved the mistake for me."},{"product_id":"9985602560","product_category":"Electronics","review_body":"It work fine with my Coby tablet very good reception , but it was not work with my Galaxy tab 2  7\\\\\""},{"product_id":"9985602560","product_category":"Electronics","review_body":"working okay, thanks !"},{"product_id":"9985609034","product_category":"Electronics","review_body":"Ran to projector when values didn't cut it.  Best choice I made.  Works great."},{"product_id":"9985609034","product_category":"Electronics","review_body":"Got this to replace a shorter cable.  Unbelievably happy with the cable.  VERY flexible, solid build, and works great."},{"product_id":"9985609034","product_category":"Electronics","review_body":"I considered purchasing this cable because of its discription as being for a Sony Bravia TV. Instead, I got a cheap generic 28 awg cable from china or somewhere in Asia. The resolution is terrible and will not always work. I had to order another cable on ebay. I want to return it for a full refund but have no means of contacting the seller through Amazon. I am very hesitant about ordering from amazon again."},{"product_id":"9985609034","product_category":"Electronics","review_body":"ok"},{"product_id":"9985609034","product_category":"Electronics","review_body":"Just what I expected, well design and very usefull"},{"product_id":"9985609034","product_category":"Electronics","review_body":"This product really worked with what I purchased it for.  It was easy to connect.  Yes, I would recommend it."},{"product_id":"9985609034","product_category":"Electronics","review_body":"Pretty dang good I should say."},{"product_id":"9985609034","product_category":"Electronics","review_body":"The video works great but no audio. Had to add another wire for the audio. The delivery was on time."},{"product_id":"9985665899","product_category":"Electronics","review_body":"This item was exactly what I was looking for to play back my pictures on a high def TV.  I am glad I was able to get it on Amazon."},{"product_id":"9985665899","product_category":"Electronics","review_body":"used no problem at all."},{"product_id":"9985665899","product_category":"Electronics","review_body":"when I bought this item I was not expecting it to work but it works great and very handy for my camera thank you"},{"product_id":"9985665899","product_category":"Electronics","review_body":"I haven't used it much, but it works very well. For the price it is great. I have not seen the &#34;original&#34;, but I am very satisfied with this &#34;knock off&#34;."},{"product_id":"9985665899","product_category":"Electronics","review_body":"The cable works flawlessly."},{"product_id":"9985665899","product_category":"Electronics","review_body":"this device works great.<br \/>it provided a chance for me to see pictures on my hi def tv."},{"product_id":"9985665899","product_category":"Electronics","review_body":"ok"},{"product_id":"9985665899","product_category":"Electronics","review_body":"I only used my cables only one time.  I am looking forward to viewing movies in the future from my television."},{"product_id":"9989511314","product_category":"Electronics","review_body":"works great, popped open when plugging it in but it went right back together, pleased with it other than that."},{"product_id":"9989511314","product_category":"Electronics","review_body":"I like the idea of using my phone with a larger screen as I do with my notebook computer.<br \/><br \/>I don't like that it is not obvious how to get the screen to display in land scape which would be so much more useful then the portrait view it currently shows.<br \/><br \/>Using an HDMI cord that is rated for game\/sound is also a good idea. (BlueRigger High speed HDMI.)<br \/><br \/>Once I figure out how to get it to display in landscape I would like to add a key board and mouse."},{"product_id":"9989511314","product_category":"Electronics","review_body":"Much the same as JustAce2006 said.<br \/>Not OEM Samsung, though it is the same size and shape as the picture.<br \/>Works fine with GSM Galaxy Nexus.<br \/>Does require power to the adapter: as far as I know, they all do (for my phone).<br \/>Set your TV's overscan\/scan\/aspect ratio if the picture seems a little cropped and make sure your phone\/tablet is charged up or it might not work."},{"product_id":"9989511314","product_category":"Electronics","review_body":"The cable did not work with my phone. I wanted the cable for the samsung galaxy Note 2. Would they be able to exchange it?"},{"product_id":"9989511314","product_category":"Electronics","review_body":"The company that sold this to me (A Days Tech) claimed that this was a genuine Samsung product on the Amazon listing.  It simply was NOT the device that was being shown in the image, but a really crappy knock off that worked maybe half the time with my TV's.  To further complicate things, after contacting the company (A Days Tech), they said they would send me a return envelope (someone also said they had &#34;already sent it&#34;) so I could get a refund.  Well, that never happened.  Then someone duped me (and I fell for it) by asking me to remove my negative feedback and they would send an RMA kit, and refund my money.  I questioned those tactics, but I did it anyway, so that didn't happen either.  Overall, the Amazon reseller (A Days Tech) in my opinion was dishonest about the product listing, the product itself was garbage, and dealing with them via email made them sound more and more shady.  To boot, their page on Amazon seems to incessantly point the finger at Amazon in their feedback section.<br \/><br \/>It seems to me that this Samsung &#34;OEM&#34; HDMI device is not what it appears to be.  I don't know if it's Amazon that is shipping this item, other Amazon retailers, or A Days Tech directly, but either way, for me it was NOT what was shown in the images.  A picture is worth a thousand words, and if the picture says Samsung, and the listing text says &#34;OEM&#34; your natural assumption is that it will say &#34;Samsung&#34; on it when you receive it.  That was not the case for my situation.<br \/><br \/>I will end with this:  Buyer be warned."},{"product_id":"9989511314","product_category":"Electronics","review_body":"this item works as advertised, it is what is described and expected, it works well and effectively, the description is appropriate"},{"product_id":"9989511314","product_category":"Electronics","review_body":"not a high quality product but, bah its ok for that money, shipping was fast and the product works good. but something you have to try not to even move your mobile in order to works perfectly"},{"product_id":"9989511314","product_category":"Electronics","review_body":"What's the point of this product when the chromecast does the same thing only better? All the extra tension added to your devices micro-USB input... Having to get up each time you need to play another video. Might as well just get a VHS recorder."},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"This is horrible...what happen to discwasher? It doesn't do what it advertises...remove dirt....they mean pushes dirt around the grooves."},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"After reading posts and reviews from audiophiles about the newer Discwasher, I am inclined to avoid it as a downward revision of a much liked original. It seems to be of inferior quality and barely worth the lowest price. Not the same as the ones made in Columbia, MO in the past. Seems the fibers are weaker and not as effective. Thanks but no thanks!"},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"While it may look like your old Discwasher that you have probably worn out, this knockoff by RCA doesn't make any sense. Why RCA changed any specification is a mystery. Everything on the original served a purpose. The reason the brush was black on the original was so that you could see the dust (and it actually grabbed the dust - unlike this model). The red threads under the black top pad was so you could see when it's wearing out. The hole in the handle of the original was to hold the fluid bottle and brush. None of these features have been preserved.<br \/><br \/>[DW]"},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"I never used the old Discwasher so I simply purchased this hoping to clean up some old LPs and convert them to MP3 files. And I could see the difference after cleaning the LPs according to the directions, and I was able to play the LPs without ruining the needle on the tone arm. But the result was still very scratchy, so there was probably a lot of microscopic dirt still on the records."},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"I recently revived my old stereo and hundreds of LP albums from the basement. There are many of these albums that never made it to CD, and I also wanted to see what people were talking about when they say that analog vinyl has a warmth that digital CDs do not. Now, a week later, I really do understand.  <br \/> <br \/>But with that warmth comes dust and dirt, which is not a problem for CDs. I remembered that back in the day the standard of excellence for disk cleaning was the Discwasher. I spent about an hour looking for my old one, gave up and bought a new one, now made by RCA.  <br \/> <br \/>The old company either went bankrupt or just sold out, but RCA has run this product into the ground - it's not what you remember. Now made in China, the wood handle is imprecisely cut so that the bottle no longer fits well inside. Instead, it gets lodged and took some time to dislodge. That's not a big issue however, but indicative of how the quality isn't what it used to be.  <br \/> <br \/>The real issue, however, is the cleaning pad. The old model had ridges of material that ran lengthwise to the handle, with the fibers angled so that they dug into the grooves and pulled out the dust, holding onto it. That's why it worked so well. What's the pad covered with now? It appears to be brown corduroy, with ridges, yes, but the fibers have no particular orientation. Thus, it does not dig into the grooves and does an even worse job of holding onto the dirt it does dislodge. I was almost going to give up on the new Discwasher as the results were so second rate.  <br \/> <br \/>I was very disappointed, but thought maybe my memory had built the old Discwasher into something Herculean that didn't match reality. Memory has a way of accentuating either the positives of negatives.  <br \/> <br \/>Well, today I found the old Discwasher, and let me tell you, if anything my memory didn't give the old product enough praise. I have now cleaned several LPs with the old one, and there's an absolute worldof difference. The old one digs the dirt out and keeps it in the pad until you brush it out, completely unlike the one that RCA is peddling these days. The new one leaves a lot of dust on the disc no matter how carefully you roll the brush.  <br \/> <br \/>Shame on you RCA for exploiting and cheapening a venerable old brand. What would it have cost you to put the proper fabric on the pad as opposed to corduroy? Maybe 15 cents per item?? But then again I guess they get the corduroy clippings cheap from a GAP factory in China.  <br \/> <br \/>Yes, it looks like the Discwasher of old, but that's the extent of the resemblance. If you're looking for the Discwasher you remember, look in the basement; maybe you'll get really lucky like I did. Or, look on eBay, but do not look to RCA.  <br \/> <br \/>For those reviewers writing reviews based on the historic quality of this product - you haven't bought this new version. It really is remarkably inferior. <br \/> <br \/>Shame on you RCA for what you've done to this product.  <br \/>"},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"I really miss the hole on the side that the record cleaner would stay in, but I bought a discwasher back in the 80's, and this 2011 version cost less. The best thing I've ever seen for keeping your records clean and pop-free!"},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"This is NOT the original! I was horribly disappointed with this purchase. Thankfully, I kept my original Discwasher and continue to use this 25+ year-old product over this new piece of junk!"},{"product_id":"B000000X4N","product_category":"Electronics","review_body":"I bought one of these and the RCA is nothing like the Discwasher of years gone by. The picture is misleading what you get is the RCA. Does not clean well you are better off getting a used Discwasher kit. Save your money"},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"SOUND BLEED THROUGH WHEN I USED THE BACK SIDE-<br \/>OTHER WISE IT WAS GOOD."},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"I have used the product previously and as usual it works fine. Getting hard to find though. Thanks.  Hope Maxell is still manufacturing them."},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"They work for 2 hours"},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"I miss making tapes. Now I have gotten myself a cassette tape boom box and and very into making new mix tapes for my peeps. Of course most of them do not have cassette players anymore but i hope to change that, because analog is, lets face it, the way music was meant to be enjoyed. These tapes can fit a solid hour on each side which completely blows my mind apart and when I first discovered that these exist got a major boner. I think Maxell is the only company still making tapes (they may even possibly be just left over stock, sad face) but I have ordered some, and now I want to order more. I can't wait to order more. Tapes rule."},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"The sound of the tapes was extraordinarily crisp and clear.  The only downside was the price. Way too expensive for me.  Otherwise, great!!<br \/>Also, why aren't they sold in stores like they used to be?<br \/><br \/>Thank you."},{"product_id":"B000001OKG","product_category":"Electronics","review_body":". . BECAUSE THESE 120 MINUTE CASSETTE AUDIO TAPES ARE NOW SO RARE AND I LIKE MY MUSIC WITH ME ALWAYS, IT'S BETTER THAN WASTING MAJOR TIME SEARCHING ONLINE TO GET WHAT I WANT, TO UP & DOWN LOAD A COMPUTER TO TRANSFER TO iPOD\/WHATEVER, RECORDING WHAT I WANT FROM MANY DIFFERENT SOURCES, THIS IS THE IDEAL, ALTHOUGH OUTDATED, STILL MY BEST PREFERENCE AND CONVENIENT CHOICE FOR M Y MUSIC PLEASURE LIBRARY!<br \/><br \/> . . . FRED K. WILLDERS"},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"The tapes were defective at the end of side A \/ beginning of side B, just like the Sony 120 min tapes. I would like replacement tapes<br \/>(undamaged), of those Maxell 120 min tapes which I purchased, because they were no better than the Sony 120 min cassette."},{"product_id":"B000001OKG","product_category":"Electronics","review_body":"Whats to state........Maxell always makes great tapes!"},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"Not even sure if they are the real Maxell tapes .very disappointed.Tapes are dammaged when i tried to use.....Very disappointed with this product.i dont want to use them in the future"},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"The best normal bias for Maxell is the UDXL I in the blue silver case If one can still find it. UR and UD are ok but Maxell has made better normal bias tapes. Their reel to reel UD are good but Radio shack is good and as good or better than Maxell.  Please note in what one is paying for NOS is a bit overpriced and not worth the price. Example, Realistic 900 feet tape was sold for $1.99  and for NOS is only worth $1.99. If it is sold online for more than you are getting a rip off because that is what it is worth and anything higher than that is a rip off."},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"These tapes came damaged, recorded outcome warped. Do not purchase unless you can overcome this defect. I was told that this outcome is due to the tapes being kept on their sides."},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"I know that it's not every day that someone goes looking for a cassette tape anymore, but by a freak chance, I happened to need some cassettes in a hurry for a church service (they don't have a CD setup). So I first looked at the local stores, which was of no luck, so I naturally went to Amazon, and was once again saved by the massive selection.<br \/><br \/>Maxell has always been an excellent brand, and I don't think I have every used any cassette other than Maxell. These are quiet tapes and don't produce any noise.<br \/><br \/>I don't know what else to say about these. If you just happen to need a cassette, these are a great option."},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"needed for something...It was good for the project"},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"The Maxell tapes arrived on time and in good condition.  These tapes record extremely well and are very reasonably priced here.  I recommend this product.  I give this a 5 star rating because it is great product and is delivered to your doorstep at no extra cost."},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"bad unit doesn't work crooked tape"},{"product_id":"B000001OKH","product_category":"Electronics","review_body":"Just like &#34;old times&#34; . Good quality, I&#34;m just glad they still sell them!"},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"It has been a while since i have used audio tapes and i was surprised that my recording came out so well."},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"Thanks"},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"Basically hard to find product.  Have used this brand for years and no problems."},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"This is a very good product, these cassettes have many purposes, you can record music, record lectures, or any thing else. Very high quality sound also."},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"The batterys will do they were a little low on the power  at 2.78 volts"},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"Used to make my girlfriend some mixtapes for her older car with a tape deck :)"},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"Good quality."},{"product_id":"B000001OKK","product_category":"Electronics","review_body":"It Is goog enough to record music on. Good quality."}]